{
    "algorithmExplanationTitle": "Qu'est-ce qu'un Algorithme ?",
    "aboutUsTitle": "À propos",
    "programmingLanguagesTitle": "Langages de programmation",
    "contributeTitle": "Contribuer",
    "donateTitle": "Faire un don",
    "topAlgorithms": "Meilleurs algorithmes",
    "featuredAlgorithms": "Algorithmes mis en avant",
    "topCategories": "Meilleures catégories",
    "searchesCategories": "Rechercher",
    "dynamicProgrammingCategories": "Programmation Dynamique",
    "sortsCategories": "Trier",
    "algorithmExplanation": "Un algorithme est un ensemble de règles qui prend une ou plusieurs entrées, puis effectue des calculs internes et des manipulations de données et renvoie une sortie ou un ensemble de sorties. Bref, les algorithmes facilitent la vie. Des manipulations de données complexes et des hachages à l'arithmétique simple, les algorithmes suivent un ensemble d'étapes pour produire un résultat utile. Un exemple d'algorithme serait une fonction simple qui prend deux valeurs d'entrée, les additionne et renvoie leur somme.",
    "programmingLanguages": "Nous prenons en charge de nombreux langages de programmation. Chaque langage a son propre dépôt GitHub où tout le code des algorithmes est stocké. Voici une liste des langages de programmation actuels :",
    "ciphersCategories": "Chiffrements",
    "dataStructuresCategories": "Structures de données",
    "basicMathCategories": "Mathématiques de base",
    "imageProcessingCategories": "Traitement d'image",
    "welcomeTitle": "Bienvenue dans la plus grande bibliothèque d'algorithmes open source de GitHub",
    "searchText": "Rechercher n'importe quel algorithme",
    "aboutTextNavbar": "À propos",
    "aboutUsFooter": "À propos de nous",
    "sourceCodeFooter": "Code source",
    "moreAlgorithmCard": "En savoir plus",
    "lightModeNavbar": "Thème clair",
    "darkModeNavbar": "Thème sombre",
    "changeLanguageNavbar": "Changer de langue",
    "socialTitle": "Connecte-toi avec nous",
    "socialGitter": "Discuter sur Gitter",
    "home": "Accueil",
    "search": "Rechercher",
    "languages_count": "Et {} de plus",
    "contact": "Contact",
    "editPageEdit": "Modifier la page",
    "editPageAddImplementation": "Ajouter une implémentation",
    "editPageAddExplanation": "Ajouter une explication",
    "addExplanation": "Ajouter une explication pour cet algorithme",
    "editPageHelp": "Si vous rencontrez des problèmes, n'hésitez pas à vous rendre sur notre serveur [Discord] et à demander de l'aide.",
    "addImplementation": "Ajouter une autre implémentation",
    "addImplementationMissing": "Voici les liens vers les dépôts dont les implémentations manquent encore :",
    "addTranslation": "Traduisez cette explication",
    "indexMetaDescription": "Ressources open source pour l'apprentissage des structures de données et des algorithmes et leur implémentation dans n'importe quel langage de programmation",
    "algorithmMetaDescription": "{algorithm} implémenté dans {implementations}",
    "languageMetaDescription": "Algorithmes implémentés en {langue}",
    "noResults": "Aucun résultat pour",
    "emptySearch": "Rechercher un algorithme",
    "analyticsFooter": "Analytique",
    "analyticsTitle": "Analytique sur ce site",
    "githubRepository": "Dépôt GitHub",
    "documentationLanguage": "Documentation",
    "contributorsMore": "et {numberContributors} autres contributeurs",
    "contributorsTitle": "{algorithm} Contributeurs",
    "contributorsOneCommit": "1 commit",
    "contributorsCommits": "{numberCommits} soumission",
    "internalServerError": "Erreur interne du serveur",
    "playgroundRunCode": "Exécuter le code",
    "playgroundUnsupported": "Votre navigateur ne prend pas en charge Web Assembly\net ne peut donc pas exécuter le code.\n \nVous pouvez toujours modifier le code sur la gauche.",
    "playgroundErrIdNotFound": "L'identifiant du terrain de jeu n'a pas été trouvé",
    "playgroundErrInvalidLink": "Le lien du terrain de jeu est invalide",
    "aboutThisAlgorithm": "À propos de cet Algorithme",
    "playgroundLoadingPackage": "Chargement de {package}",
    "playgroundReady": "Prêt ! Commencez par éditer le code sur le\ncôté gauche de l'écran et en cliquant sur \"Exécuter le code \"",
    "fullscreen": "Plein écran",
    "socialDiscord": "Discuter sur Discord",
    "algorithmExplaniationFooter": "Qu'est-ce qu'un algorithme ?",
    "pageNotFound": "Page non trouvée",
    "aboutUs": "Nous sommes un groupe de programmeurs qui s'entraident pour créer de nouvelles choses, qu'il s'agisse d'écrire des programmes de chiffrement complexes ou de simples chiffrements. Notre objectif est de travailler ensemble pour documenter et modéliser de beaux algorithmes utiles et intéressants à l'aide de code. Nous sommes une communauté open source - tout le monde peut contribuer. Nous vérifions le travail de chacun, communiquons et collaborons pour résoudre les problèmes. Nous nous efforçons d'être accueillants, respectueux, tout en veillant à ce que notre code respecte les dernières directives de programmation.",
    "contribute": "Êtes-vous intéressé par une contribution ? Il existe de nombreuses façons de contribuer, comme traduire, corriger des erreurs (d'orthographe), améliorer le code, etc. Si vous débutez, recherchez les problèmes avec l'étiquette \"bon premier problème\"..",
    "donateButton": "Faire un don",
    "donateText": "Vous pouvez soutenir notre travail en open-source via [Liberapay]. En nous faisant un don, vous recevrez un rôle spécial sur notre serveur Discord et vous nous aiderez à maintenir ce projet en vie. Merci pour votre soutien, que vous donniez ou non.",
    "algorithmMetaDescriptionExplained": "{algorithm} expliqué et implémenté dans {implementations}",
    "helloAlgorithms": "Bonjour, algorithms !",
    "socialGithub": "Contribuer sur GitHub",
    "langImplementation": "Implémentation de {language}",
    "editPageTranslate": "Traduire l'explication",
    "addExplanationInfo": "Cet algorithme n'a pas encore d'explication. Les explications se trouvent dans le dépôt [Algorithms-Explanations]. Si vous souhaitez ajouter une explication, forkez ce dépôt et ajoutez l'explication en tant que fichier markdown ([exemple]). Une fois que vous avez terminé, vous pouvez ouvrir une pull request pour fusionner votre explication.",
    "analyticsText": "Nous utilisons [Plausible Analytics] sur ce site pour collecter des données d'utilisation anonymes afin de voir combien de personnes utilisent notre site Web et quelles sont les fonctionnalités les plus utilisées. Le site Web ne suit en aucun cas les visiteurs individuels. Toutes les données sont uniquement agrégées. Aucune donnée personnelle n'est collectée et aucun cookie n'est utilisé. Vous pouvez consulter toutes les données collectées ici :",
    "playgroundWelcome": "Bienvenue dans le terrain de jeu de The Algorithms 👋",
    "codeplayground": "Terrain de jeu",
    "addImplementationInfo": "Pour ajouter une implémentation dans une autre langue, veuillez visiter le dépôt de cette langue et suivez les instructions données dans <code>README.md</code> et <code>CONTRIBUTING.md</code>.",
    "addTranslationInfo": "L'explication de cet algorithme n'a pas encore été traduite dans votre langue. Pour traduire cette explication, veuillez visiter le dépôt [Algorithms-Explanation]. Forkez ce dépôt et ajoutez votre traduction en tant que nouveau fichier Markdown basé sur l'anglais [<code>{ogFilename}</code>] dans le bon dossier pour votre locale (<code>{locale}</code>). Lorsque vous avez traduit le fichier, vous pouvez créer une nouvelle pull request pour fusionner votre traduction.",
    "viewOnGithub": "Voir sur GitHub",
    "playgroundTryCode": "Essayez ce code"
}
