{
    "algorithmExplanationTitle": "ಅಲ್ಗಾರಿದಮ್ ಎಂದರೇನು?",
    "algorithmExplanation": "ಅಲ್ಗಾರಿದಮ್ ಎಂದರೆ ಒಂದು ಅಥವಾ ಹೆಚ್ಚಿನ ಇನ್‌ಪುಟ್‌ಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳುವ ನಿಯಮಗಳ ಗುಂಪಾಗಿದ್ದು, ನಂತರ ಆಂತರಿಕ ಲೆಕ್ಕಾಚಾರಗಳು ಮತ್ತು ಡೇಟಾ ಮ್ಯಾನಿಪ್ಯುಲೇಷನ್‌ಗಳನ್ನು ನಿರ್ವಹಿಸುತ್ತದೆ ಮತ್ತು ಔಟ್‌ಪುಟ್ ಅಥವಾ ಔಟ್‌ಪುಟ್‌ಗಳ ಗುಂಪನ್ನು ಹಿಂದಿರುಗಿಸುತ್ತದೆ. ಸಂಕ್ಷಿಪ್ತವಾಗಿ ಹೇಳುವುದಾದರೆ, ಅಲ್ಗಾರಿದಮ್‌ಗಳು ಜೀವನವನ್ನು ಸುಲಭಗೊಳಿಸುತ್ತವೆ. ಸಂಕೀರ್ಣ ಡೇಟಾ ಮ್ಯಾನಿಪ್ಯುಲೇಷನ್‌ಗಳು ಮತ್ತು ಹ್ಯಾಶ್‌ಗಳಿಂದ ಹಿಡಿದು, ಸರಳ ಅಂಕಗಣಿತದವರೆಗೆ, ಅಲ್ಗಾರಿದಮ್‌ಗಳು ಉಪಯುಕ್ತ ಫಲಿತಾಂಶವನ್ನು ಉತ್ಪಾದಿಸಲು ಹಂತಗಳ ಗುಂಪನ್ನು ಅನುಸರಿಸುತ್ತವೆ. ಅಲ್ಗಾರಿದಮ್‌ನ ಒಂದು ಉದಾಹರಣೆಯೆಂದರೆ ಎರಡು ಇನ್‌ಪುಟ್ ಮೌಲ್ಯಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳುವ, ಅವುಗಳನ್ನು ಒಟ್ಟಿಗೆ ಸೇರಿಸುವ ಮತ್ತು ಅವುಗಳ ಮೊತ್ತವನ್ನು ಹಿಂದಿರುಗಿಸುವ ಸರಳ ಕಾರ್ಯ.",
    "aboutUsTitle": "ನಮ್ಮ ಬಗ್ಗೆ",
    "aboutUs": "ನಾವು ಹೊಸ ವಿಷಯಗಳನ್ನು ನಿರ್ಮಿಸಲು ಪರಸ್ಪರ ಸಹಾಯ ಮಾಡುವ ಪ್ರೋಗ್ರಾಮರ್‌ಗಳ ಗುಂಪಾಗಿದ್ದೇವೆ, ಅದು ಸಂಕೀರ್ಣ ಎನ್‌ಕ್ರಿಪ್ಶನ್ ಪ್ರೋಗ್ರಾಂಗಳನ್ನು ಬರೆಯುವುದಾಗಿರಬಹುದು ಅಥವಾ ಸರಳ ಸೈಫರ್‌ಗಳಾಗಿರಬಹುದು. ಕೋಡ್ ಅನ್ನು ಬಳಸಿಕೊಂಡು ಸುಂದರವಾದ, ಸಹಾಯಕವಾದ ಮತ್ತು ಆಸಕ್ತಿದಾಯಕ ಅಲ್ಗಾರಿದಮ್‌ಗಳನ್ನು ದಾಖಲಿಸಲು ಮತ್ತು ಮಾದರಿ ಮಾಡಲು ಒಟ್ಟಾಗಿ ಕೆಲಸ ಮಾಡುವುದು ನಮ್ಮ ಗುರಿಯಾಗಿದೆ. ನಾವು ಮುಕ್ತ ಮೂಲ ಸಮುದಾಯ - ಯಾರಾದರೂ ಕೊಡುಗೆ ನೀಡಬಹುದು. ನಾವು ಪರಸ್ಪರರ ಕೆಲಸವನ್ನು ಪರಿಶೀಲಿಸುತ್ತೇವೆ, ಸಂವಹನ ನಡೆಸುತ್ತೇವೆ ಮತ್ತು ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸಲು ಸಹಯೋಗಿಸುತ್ತೇವೆ. ನಾವು ಸ್ವಾಗತಾರ್ಹರಾಗಿ, ಗೌರವಯುತವಾಗಿರಲು ಪ್ರಯತ್ನಿಸುತ್ತೇವೆ, ಆದರೆ ನಮ್ಮ ಕೋಡ್ ಇತ್ತೀಚಿನ ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಮಾರ್ಗಸೂಚಿಗಳನ್ನು ಅನುಸರಿಸುತ್ತದೆ ಎಂದು ಖಚಿತಪಡಿಸಿಕೊಳ್ಳುತ್ತೇವೆ.",
    "programmingLanguagesTitle": "ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಭಾಷೆಗಳು",
    "programmingLanguages": "ನಾವು ಅನೇಕ ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಭಾಷೆಗಳನ್ನು ಬೆಂಬಲಿಸುತ್ತೇವೆ. ಪ್ರತಿಯೊಂದು ಭಾಷೆಯು ತನ್ನದೇ ಆದ GitHub ಭಂಡಾರವನ್ನು ಹೊಂದಿದ್ದು, ಅಲ್ಲಿ ಅಲ್ಗಾರಿದಮ್‌ಗಳ ಎಲ್ಲಾ ಕೋಡ್‌ಗಳನ್ನು ಸಂಗ್ರಹಿಸಲಾಗುತ್ತದೆ. ಪ್ರಸ್ತುತ ಪ್ರೋಗ್ರಾಮಿಂಗ್ ಭಾಷೆಗಳ ಪಟ್ಟಿ ಇಲ್ಲಿದೆ:",
    "contributeTitle": "ಕೊಡುಗೆ ನೀಡಿ",
    "contribute": "ನೀವು ಕೊಡುಗೆ ನೀಡಲು ಆಸಕ್ತಿ ಹೊಂದಿದ್ದೀರಾ? ಅನುವಾದಿಸುವುದು, (ಕಾಗುಣಿತ) ದೋಷಗಳನ್ನು ಸರಿಪಡಿಸುವುದು, ಕೋಡ್ ಅನ್ನು ಸುಧಾರಿಸುವುದು ಮುಂತಾದ ಕೊಡುಗೆ ನೀಡಲು ಹಲವು ಉತ್ತಮ ಮಾರ್ಗಗಳಿವೆ. ನೀವು ಇದೀಗ ಪ್ರಾರಂಭಿಸುತ್ತಿದ್ದರೆ, 'ಮೊದಲ ಉತ್ತಮ ಸಂಚಿಕೆ' ಲೇಬಲ್‌ನೊಂದಿಗೆ ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಶೀಲಿಸಿ.",
    "donateTitle": "ದಾನ ಮಾಡಿ",
    "topAlgorithms": "ಉನ್ನತ ಕ್ರಮಾವಳಿಗಳು",
    "featuredAlgorithms": "ವೈಶಿಷ್ಟ್ಯಗೊಳಿಸಿದ ಅಲ್ಗಾರಿದಮ್‌ಗಳು",
    "topCategories": "ಉನ್ನತ ವರ್ಗಗಳು",
    "searchesCategories": "ಹುಡುಕಾಟಗಳು"
}
