{
    "contact": "Kontakt",
    "languages_count": "I još {}",
    "search": "Pretraga",
    "home": "Početna stranica",
    "pageNotFound": "Stranica nije pronađena",
    "socialDiscord": "Raspravljaj na Discordu",
    "socialGitter": "Raspravljaj na Gitteru",
    "socialGithub": "Doprinesi na GitHubu",
    "socialTitle": "Priključi nam se",
    "changeLanguageNavbar": "Promijeni jezik",
    "darkModeNavbar": "Tamni modus",
    "lightModeNavbar": "Svijetli modus",
    "moreAlgorithmCard": "Više",
    "donateText": "Drugi način na koji nas možeš podržati su donacije putem [Liberapay]. Čak i mali iznosi nam pomažu. Donacije znače da cijeniš i da ti se sviđa naš rad. Ako ti se ne sviđa, ne moraš donirati. Donacije omogućuju najboljim članovima i ubuduće doprinositi projektima Algoritmi. Zahvalni smo za sve donacije, bez obzira na iznos.",
    "donateButton": "Doniraj",
    "sourceCodeFooter": "Izvorni kod",
    "allAlgorithmsFooter": "Svi algoritmi",
    "aboutUsFooter": "O nama",
    "algorithmExplaniationFooter": "Što je algoritam?",
    "aboutTextNavbar": "O nama",
    "searchText": "Traži algoritam",
    "welcomeTitle": "Dobro došao, dobro došla u najveću GitHub biblioteku algoritama otvorenog koda",
    "helloAlgorithms": "Hej, algoritmi!",
    "imageProcessingCategories": "Obrađivanje slika",
    "basicMathCategories": "Osnovna matematika",
    "dataStructuresCategories": "Struktura podataka",
    "ciphersCategories": "Šifriranje",
    "dynamicProgrammingCategories": "Dinamičko programiranje",
    "searchesCategories": "Pretraživanje",
    "sortsCategories": "Razvrstavanje",
    "topCategories": "Popularne kategorije",
    "featuredAlgorithms": "Izabrani algoritmi",
    "topAlgorithms": "Popularni algoritmi",
    "donateTitle": "Doniraj",
    "contribute": "Radujemo se svim doprinosima u tim repozitorijima, od dodavanja vlastitih algoritama do mijenjanja ili ispravljanja postojećih. Prije nego što počneš, obavezno pročitaj upute za doprinošenje koje se nalaze u datoteci CONTRIBUTING.md u repozitoriju. Poštuj rad drugih članova, pomaži gdje možeš i pazi da koristiš najnoviju verziju programskog jezika. Nakon što pročitaš upute, dupliciraj repozitorij, izradi izmjene, a zatim ih pošalji kao zahtjev za povlačenjem. Uostalom, možeš pomoći prevoditi web-stranice pomoću [Weblate] sustava.",
    "contributeTitle": "Doprinesi",
    "programmingLanguages": "Podržavamo mnoge programske jezike. Svaki jezik ima svoj GitHub repozitorij u kojem je spremljen sav kod algoritama. Ovo je popis trenutačnih programskih jezika:",
    "programmingLanguagesTitle": "Programski jezici",
    "aboutUs": "Mi smo grupa programera koji pomažu jedni drugima u stvaranju novih stvari, bilo da se radi o pisanju složenih programa ili jednostavnih algoritama za šifriranje. Cilj nam je, zajedno dokumentirati i izraditi lijepe, korisne i zanimljive algoritme pomoću kodiranja. Mi smo zajednica otvorenog koda – svatko može doprinijeti. Međusobno provjeravamo rad, komuniciramo i surađujemo u rješavanju problema. Nastojimo biti gostoljubivi i pristojni, dok istovremeno vodimo računa o tome, da naš kod udovoljava najnovijim zahtjevima suvremenog programiranja.",
    "aboutUsTitle": "O nama",
    "algorithmExplanation": "Algoritam je skup pravila koji uzima jedan ili više unosa, zatim izvodi unutarnje izračune i manipulacije podacima te vraća rezultat ili skup rezultata. Ukratko, algoritmi olakšavaju život. Od složenih manipulacija i mapiranja podataka, do jednostavne aritmetike, algoritmi slijede niz koraka kako bi proizveli koristan rezultat. Primjer algoritma je jednostavna funkcija koja uzima dvije vrijednosti unosa, zbraja ih i vraća njihov zbroj.",
    "algorithmExplanationTitle": "Što je algoritam?",
    "viewOnGithub": "Pogledaj na GitHubu",
    "addTranslationInfo": "Dupliciraj ovaj repozitorij i dodaj objašnjenje kao datoteku s markdown formatiranjem na osnovi engleske verzije [<code>{ogFilename}</code>] u mapi tvog jezika (<code>{locale}</code>). Kad prevedeš datoteku, možeš otvoriti zahtjev za povlačenje kako bi se tvoj prijevod preuzeo.",
    "addTranslation": "Prevedi ovo objašnjenje",
    "editPageHelp": "Ako imaš bilo kakvih problema, zatraži pomoć na našem [Discord] poslužitelju.",
    "addExplanationInfo": "Ovaj algoritam još nema objašnjenje. Objašnjenja se nalaze u repozitoriju [Algorithms-Explanations]. Ako želiš dodati objašnjenje, dupliciraj ovaj repozitorij i dodaj objašnjenje kao datoteku s markdown formatiranjem ([primjer]). Kad je datoteka spremna, možeš otvoriti zahtjev za povlačenje kako bi se tvoje objašnjenje preuzelo.",
    "addImplementationMissing": "Ovo su poveznice na repozitorije koji još uvijek nemaju primjenu:",
    "addImplementationInfo": "Za dodavanje primjene na jednom drugom jeziku, posjeti repozitorij za taj jezik i slijedi upute u datotekama <code>README.md</code> i <code>CONTRIBUTING.md</code>.",
    "addImplementation": "Dodaj jednu drugu primjenu",
    "editPageAddImplementation": "Dodaj primjenu",
    "addExplanation": "Dodaj objašnjenje za algoritam",
    "editPageTranslate": "Prevedi objašnjenje",
    "editPageAddExplanation": "Dodaj objašnjenje",
    "editPageEdit": "Uredi stranicu",
    "langImplementation": "{language} primjena",
    "emptySearch": "Traži algoritam",
    "noResults": "Nema rezultata za",
    "languageMetaDescription": "U {language} primijenjeni algoritmi",
    "algorithmMetaDescriptionExplained": "{algorithm} objašnjen i primijenjen u {implementations}",
    "algorithmMetaDescription": "{algorithm} primijenjen u {implementations}",
    "indexMetaDescription": "Resurs otvorenog koda za učenje struktura podataka i algoritama te njihovu primjenu u bilo kojem programskom jeziku",
    "analyticsText": "Na ovoj stranici koristimo [Plausible Analytics] za prikupljanje anonimnih podataka o korištenju stranice, kako bismo vidjeli koliko ljudi koristi našu web stranicu i koje su najčešće korištene funkcije. Web stranica ne prati pojedinačne posjetitelje. Svi podaci se samo zbrajaju. Ne prikupljaju se osobni podaci i ne koriste se kolačići. Sve prikupljene podatke možeš pogledati ovdje:",
    "analyticsTitle": "Analitika na ovoj stranici",
    "analyticsFooter": "Analitika",
    "documentationLanguage": "Dokumentacija",
    "githubRepository": "GitHub repozitorij"
}
