{
    "contact": "Kontakt",
    "languages_count": "I još {}",
    "search": "Pretraga",
    "home": "Početna stranica",
    "pageNotFound": "Stranica nije pronađena",
    "socialDiscord": "Raspravljaj na Discordu",
    "socialGitter": "Raspravljaj na Gitteru",
    "socialGithub": "Doprinesi na GitHubu",
    "socialTitle": "Priključi nam se",
    "changeLanguageNavbar": "Promijeni jezik",
    "darkModeNavbar": "Tamni modus",
    "lightModeNavbar": "Svijetli modus",
    "moreAlgorithmCard": "Više",
    "donateText": "Drugi način na koji nas možeš podržati su donacije putem [Liberapay]. Čak i mali iznosi nam pomažu. Donacije znače da cijeniš i da ti se sviđa naš rad. Ako ti se ne sviđa, ne moraš donirati. Donacije omogućuju najboljim članovima i ubuduće doprinositi projektima Algoritmi. Zahvalni smo za sve donacije, bez obzira na iznos.",
    "donateButton": "Doniraj",
    "sourceCodeFooter": "Izvorni kod",
    "allAlgorithmsFooter": "Svi algoritmi",
    "aboutUsFooter": "O nama",
    "algorithmExplaniationFooter": "Što je algoritam?",
    "aboutTextNavbar": "O nama",
    "searchText": "Traži algoritam",
    "welcomeTitle": "Dobro došao, dobro došla u najveću GitHub biblioteku algoritama otvorenog koda",
    "helloAlgorithms": "Hej, algoritmi!",
    "imageProcessingCategories": "Obrađivanje slika",
    "basicMathCategories": "Osnovna matematika",
    "dataStructuresCategories": "Struktura podataka",
    "ciphersCategories": "Šifriranje",
    "dynamicProgrammingCategories": "Dinamičko programiranje",
    "searchesCategories": "Pretraživanje",
    "sortsCategories": "Razvrstavanje",
    "topCategories": "Popularne kategorije",
    "featuredAlgorithms": "Izabrani algoritmi",
    "topAlgorithms": "Popularni algoritmi",
    "donateTitle": "Doniraj",
    "contribute": "Radujemo se svim doprinosima u tim repozitorijima, od dodavanja vlastitih algoritama do mijenjanja ili ispravljanja postojećih. Prije nego što počneš, obavezno pročitaj upute za doprinošenje koje se nalaze u datoteci CONTRIBUTING.md u repozitoriju. Poštuj rad drugih članova, pomaži gdje možeš i pazi da koristiš najnoviju verziju programskog jezika. Nakon što pročitaš upute, dupliciraj repozitorij, izradi izmjene, a zatim ih pošalji kao zahtjev za povlačenjem. Uostalom, možeš pomoći prevoditi web-stranice pomoću [Weblate] sustava.",
    "contributeTitle": "Doprinesi",
    "programmingLanguages": "Podržavamo mnoge programske jezike. Svaki jezik ima svoj GitHub repozitorij u kojem je spremljen sav kod algoritama. Ovo je popis trenutačnih programskih jezika:",
    "programmingLanguagesTitle": "Programski jezici",
    "aboutUs": "Mi smo grupa programera koji pomažu jedni drugima u stvaranju novih stvari, bilo da se radi o pisanju složenih programa ili jednostavnih algoritama za šifriranje. Cilj nam je, zajedno dokumentirati i izraditi lijepe, korisne i zanimljive algoritme pomoću kodiranja. Mi smo zajednica otvorenog koda – svatko može doprinijeti. Međusobno provjeravamo rad, komuniciramo i surađujemo u rješavanju problema. Nastojimo biti gostoljubivi i pristojni, dok istovremeno vodimo računa o tome, da naš kod udovoljava najnovijim zahtjevima suvremenog programiranja.",
    "aboutUsTitle": "O nama",
    "algorithmExplanation": "Algoritam je skup pravila koji uzima jedan ili više unosa, zatim izvodi unutarnje izračune i manipulacije podacima te vraća rezultat ili skup rezultata. Ukratko, algoritmi olakšavaju život. Od složenih manipulacija i mapiranja podataka, do jednostavne aritmetike, algoritmi slijede niz koraka kako bi proizveli koristan rezultat. Primjer algoritma je jednostavna funkcija koja uzima dvije vrijednosti unosa, zbraja ih i vraća njihov zbroj.",
    "algorithmExplanationTitle": "Što je algoritam?"
}
