{
    "aboutUs": "ہم پروگرامرز کا ایک گروہ ہیں جو آپس میں تعاون کرتے ہیں تاکہ نئی چیزوں کو تخلیق کرنے میں مدد کرسکیں- چاہے وہ پیچیدہ، خفیہ طریقے سے کوڈ کولکھنا ہو یا سادہ سائفر۔ ہمارا مقصد آپس میں سے کام کرنا اور خوبصورت، مددگار اور دلچسپ الگورتھمز کو کوڈ کے ذریعے لکھنا اور ماڈل کرنا ہے۔ ہم ایک اوپن سورس کمیونٹی کی حیثیت رکھتے ہیں - جس میں کوئی بھی شخص حصہ لے سکتا ہے۔ ہم آپس میں ایک دوسرے کے کاموں کا جائزہ لیتے ہیں، تبادلہ خیال کرتے ہیں اور مسائل کے حل کے لئے ایک دوسرے کی مدد کرتے ہیں۔ ہم آپ کا خیرمقدم اور عزت کرتے ہیں اور ساتھ ہی کوشش کرتے ہیں کہ ہمارا کوڈ ہمیشہ تازہ ترین پروگرامنگ ہدایات کے مطابق ہو۔",
    "algorithmExplanationTitle": "الگورتھم کیا ہے؟",
    "aboutUsTitle": "ہمارےبارےمیں",
    "programmingLanguagesTitle": "پروگرامنگ لینگوئجز",
    "programmingLanguages": "ہم مختلف پروگرامنگ لینگوئجز میں تعاون فراہم کرتے ہیں۔ ہر لینگویج کے لئے ایک علیحدہ گیٹ ہب ریپوزیٹری ہوتی ہے جہاں الگورتھمز کے تمام کوڈ محفوظ ہوتے ہیں۔ یہاں موجود حالیہ پروگرامنگ لینگویجز کی فہرست درج ہے:",
    "contributeTitle": "تعاون کریں.",
    "contribute": "کیا آپ بھی تعاون کرنے میں دلچسپی رکھتے ہیں؟ ایسا کرنے کے بہت سے بہترین طریقے ہیں، جیسے کہ ترجمہ کرنا، (ہجے) کی غلطیاں درست کرنا، کوڈ کو بہتر بنانا، وغیرہ۔ اگر آپ ابھی شروعات کر رہے ہیں، تو 'اچھا پہلا موضوع' لیبل والے مسائل سے آغاز کر سکتے ہیں۔",
    "donateTitle": "عطیہ کریں۔",
    "topAlgorithms": "سرفہرست الگورتھم",
    "featuredAlgorithms": "نمایاں الگورتھم",
    "algorithmExplanation": "الگورتھم قواعد کا ایک مجموعہ ہوتا ہے جو ایک یا زیادہ ان پٹس کو قبول کرتا ہے، اندرونی حسابات اور ڈیٹا کی تجزیے کو استعمال کرتے ہوئے آخری نتائج یا آؤٹ پٹ کا مجموعہ فراہم کرتے ہیں۔ مختصراً، الگورتھمز زندگی کو آسان بنانے میں مددگار ثابت ہوتے ہیں۔ یہ پیچیدہ ڈیٹا کے تجزیے کو ترتیب دینے سے لے کر سادہ ریاضیاتی عملیات تک کے لئے مختلف اقدامات پر عمل کرتے ہوئے مفید نتائج مرتب کرتے ہیں۔ الگورتھم کی مثال کو ایک سادہ فنکشن سے سمجتے ہیں جو دو ان پٹ ویلیوز لے، انہیں ایک ساتھ جوڑے، اور ان کی رقم واپس کرے۔",
    "ciphersCategories": "خفیہ انداز میں تحریر",
    "dataStructuresCategories": "ڈیٹا کی ساخت",
    "basicMathCategories": "بنیادی ریاضی",
    "topCategories": "سر فہرست زمرہ جات",
    "sortsCategories": "قسمیں",
    "searchesCategories": "تلاش کریں",
    "dynamicProgrammingCategories": "متحرک پروگرام کی تخلیق",
    "imageProcessingCategories": "تصا ویر کو عددی شکل دے کر تجزیہ کرنا",
    "helloAlgorithms": "ہیلو، الگورتھم!",
    "welcomeTitle": "گیٹ ہب کی سب سے بڑی اوپن سورس الگورتھم لائبریری میں خوش آمدید",
    "searchText": "کسی الگورتھم کی تلاش کریں",
    "aboutTextNavbar": "بارے میں",
    "algorithmExplaniationFooter": "الگورتھم کیا ہے؟",
    "aboutUsFooter": "ہمارے بارے میں",
    "sourceCodeFooter": "سورس کوڈ",
    "donateButton": "عطیہ کریں"
}
