{
    "algorithmExplanationTitle": "Algoritm nima?",
    "aboutUsTitle": "Biz haqimizda",
    "programmingLanguagesTitle": "Dasturlash tillari",
    "programmingLanguages": "Biz ko'plab dasturlash tillarini qo'llab-quvvatlaymiz. Har bir tilda algoritmlar uchun barcha kodlar saqlanadigan o'z GitHub ombori mavjud. Bu erda joriy dasturlash tillari ro'yxati:",
    "donateTitle": "Xayriya",
    "topAlgorithms": "Eng yaxshi algoritmlar",
    "topCategories": "Yuqori toifalar",
    "sortsCategories": "Saralash",
    "searchesCategories": "Qidiruvlar",
    "dynamicProgrammingCategories": "Dinamik dasturlash",
    "ciphersCategories": "Shifrlar",
    "dataStructuresCategories": "Ma'lumotlar tuzilmalari",
    "basicMathCategories": "Asosiy matematika",
    "imageProcessingCategories": "Tasvirga ishlov berish",
    "helloAlgorithms": "Salom, algoritmlar!",
    "welcomeTitle": "GitHub’ning eng katta ochiq kodli algoritm kutubxonasiga xush kelibsiz",
    "searchText": "Har qanday algoritmni qidiring",
    "aboutTextNavbar": "Haqida",
    "algorithmExplaniationFooter": "Algoritm nima?",
    "aboutUsFooter": "Biz haqimizda",
    "sourceCodeFooter": "Manba kodi",
    "donateButton": "Xayriya",
    "moreAlgorithmCard": "Ko'proq",
    "lightModeNavbar": "Yorug' rejim",
    "darkModeNavbar": "Qorong'u rejim",
    "changeLanguageNavbar": "Tilni o'zgartirish",
    "socialTitle": "Biz bilan bog'laning",
    "socialGithub": "GitHub’da hissa qo‘shing",
    "socialGitter": "Gitterda suhbat",
    "socialDiscord": "Discord-da suhbat",
    "pageNotFound": "Sahifa topilmadi",
    "home": "Uy",
    "search": "Qidirish",
    "languages_count": "Va yana {} ta",
    "langImplementation": "{language} Amalga oshirish",
    "contact": "Aloqa",
    "editPageEdit": "Sahifani tahrirlash",
    "editPageAddExplanation": "Tushuntirish qo'shing",
    "editPageTranslate": "Tarjima tushuntirish",
    "addExplanation": "Ushbu algoritm uchun tushuntirish qo'shing",
    "editPageHelp": "Agar sizda biron bir muammo bo'lsa, bizning [Discord] serverimizga tashrif buyuring va yordam so'rang.",
    "addImplementation": "Boshqa dastur qo'shing",
    "addTranslation": "Ushbu tushuntirishni tarjima qiling",
    "viewOnGithub": "GitHub-da ko'rish",
    "algorithmExplanation": "Algoritm - bu bir yoki bir nechta kirishlarni qabul qiladigan, so'ngra ichki hisob-kitoblar va ma'lumotlar bilan ishlov berishni amalga oshiradigan va chiqish yoki chiqishlar to'plamini qaytaradigan qoidalar to'plami. Qisqasi, algoritmlar hayotni osonlashtiradi. Murakkab ma'lumotlar manipulyatsiyasi va xeshlardan tortib oddiy arifmetikagacha, algoritmlar foydali natija olish uchun bir qator qadamlarni bajaradi. Algoritmning bir misoli, ikkita kirish qiymatini oladigan, ularni bir-biriga qo'shadigan va ularning yig'indisini qaytaradigan oddiy funksiya bo'lishi mumkin.",
    "contributeTitle": "Hissa qo‘shmoq",
    "addImplementationInfo": "Boshqa tilda dastur qo‘shish uchun ushbu tilning omboriga tashrif buyuring va <code>README.md</code> va <code>CONTRIBUTING.md</code> da berilgan ko‘rsatmalarga amal qiling.",
    "aboutUs": "Biz bir-birimizga yangi narsalarni yaratishda yordam beradigan dasturchilar guruhimiz, xoh u murakkab shifrlash dasturlarini yozish, xoh oddiy shifrlar. Bizning maqsadimiz kod yordamida chiroyli, foydali va qiziqarli algoritmlarni hujjatlashtirish va modellashtirish uchun birgalikda ishlashdir. Biz ochiq manbali hamjamiyatmiz - har kim o'z hissasini qo'shishi mumkin. Biz bir-birimizning ishimizni tekshiramiz, muloqot qilamiz va muammolarni hal qilish uchun hamkorlik qilamiz. Biz mehmondo'st, hurmatli bo'lishga intilamiz, lekin bizning kodimiz eng so'nggi dasturlash ko'rsatmalariga amal qilishiga ishonch hosil qilamiz.",
    "featuredAlgorithms": "Belgilangan algoritmlar",
    "donateText": "Bizni qo'llab-quvvatlashingizning yana bir usuli - [Liberapay] orqali xayriya qilish. Hatto kichik xayriya ham juda qadrlanadi. Xayriya qilish demak, siz bizning ishimizni qadrlaysiz va yoqtirasiz. Agar bizning ishimiz sizga yoqmasa, xayriya qilishning hojati yo'q. Agar xayriya qilsangiz, eng yaxshi aʼzolar Algoritmlar loyihalariga qoʻshimcha hissa qoʻshishlari mumkin boʻladi. Biz hammadan, hamma joydan, miqdoridan qat'iy nazar xayr-ehsonlarni qadrlaymiz.",
    "editPageAddImplementation": "Amalga oshirish",
    "addExplanationInfo": "Ushbu algoritm hali tushuntirishga ega emas. Tushuntirishlar [Algorithms-Explanations] omborida joylashgan. Agar siz tushuntirish qo'shmoqchi bo'lsangiz, ushbu omborni ajratib oling va tushuntirishni belgilash fayli sifatida qo'shing ([example]). Tugatganingizdan so'ng, tushuntirishingizni birlashtirish uchun tortishish so'rovini ochishingiz mumkin.",
    "addImplementationMissing": "Hali ham amalga oshirilmagan omborlarga havolalar:",
    "languageMetaDescription": "Algoritmlar {language} tilida",
    "playgroundTryCode": "Ushbu kodni sinab ko'ring",
    "playgroundWelcome": "TheAlgoritms kodli maydoniga xush kelibsiz 👋",
    "aboutThisAlgorithm": "Bu algoritm haqida",
    "indexMetaDescription": "Ma'lumotlar tuzilmalari va algoritmlarini o'rganish va ularni istalgan dasturlash tilida amalga oshirish uchun ochiq manba manbasi",
    "noResults": "uchun hech qanday natija topilmadi",
    "contributorsTitle": "{algoritm} hissa qoʻshuvchilar",
    "emptySearch": "Algoritmni qidiring",
    "analyticsFooter": "Analitika",
    "analyticsTitle": "Ushbu saytdagi tahlillar",
    "githubRepository": "GitHub ombori",
    "documentationLanguage": "Hujjatlar",
    "internalServerError": "Serverdagi ichki xatolik",
    "contributorsMore": "va yana {numberContributors} ishtirokchi",
    "codeplayground": "Kod maydoni",
    "playgroundLoadingPackage": "{paket} yuklanmoqda",
    "fullscreen": "To'liq ekran",
    "playgroundReady": "Tayyor! Kodni tahrirlash orqali boshlang\nekranning chap tomonini bosing va \"Kodni ishga tushirish\" tugmasini bosing",
    "contribute": "Biz sizni ushbu omborlarga hissa qo'shishingizni tavsiya qilamiz. Agar sizda qo'shmoqchi bo'lgan algoritm, o'zgartirish yoki tuzatmoqchi bo'lgan xato bo'lsa, iltimos, shunday qiling. Lekin buni amalga oshirishdan oldin, ombordagi CONTRIBUTING.md da joylashgan hissa qo‘shish bo‘yicha ko‘rsatmalarni o‘qib chiqqaningizga ishonch hosil qiling. Siz hurmatli, foydali va tilning eng soʻnggi versiyasidan foydalanayotganingizga ishonch hosil qiling. Himoya bo'yicha ko'rsatmalarni o'qib chiqqandan so'ng, iltimos, omborni o'chiring, o'zgartirishlaringiz ustida ishlang va keyin ularni pull requests sifatida yuboring. Shuningdek, veb-saytni [Weblate] yordamida tarjima qilishda yordam berishingiz mumkin. Agar qo'shmoqchi bo'lgan boshqa tillaringiz yoki tuzatmoqchi bo'lgan satrlaringiz bo'lsa, o'z hissangizni qo'shishingiz mumkin.",
    "addTranslationInfo": "Bu algoritmning tushuntirishi hali sizning tilingizga tarjima qilinmagan. Ushbu tushuntirishni tarjima qilish uchun [Algoritmlar-Izoh] omboriga tashrif buyuring. Ushbu omborni yoping va tarjimangizni ingliz tilidagi [<code>{ogFilename}</code>] asosidagi yangi Markdown fayli sifatida mahalliy tilingizga mos jildga (<code>{locale}</code>) qo'shing. Faylni tarjima qilganingizdan so'ng, tarjimangizni birlashtirish uchun yangi pull requestni yaratishingiz mumkin.",
    "playgroundRunCode": "Kodni ishga tushirish",
    "playgroundErrIdNotFound": "Playground ID topilmadi",
    "playgroundErrInvalidLink": "Playground havolasi yaroqsiz",
    "analyticsText": "Biz ushbu saytda [Plausible Analytics] dan veb-saytimizdan qancha odam foydalanayotgani va qaysi funksiyalar eng koʻp foydalanilayotganini koʻrish uchun anonim foydalanish maʼlumotlarini toʻplash uchun foydalanamiz. Veb-sayt hech qanday tarzda individual tashrif buyuruvchilarni kuzatmaydi. Barcha ma'lumotlar faqat jamlangan. Hech qanday shaxsiy ma'lumotlar yig'ilmaydi va hech qanday cookie-fayllardan foydalanilmaydi. Bu yerda siz barcha toʻplangan maʼlumotlarni koʻrishingiz mumkin:",
    "playgroundUnsupported": "Brauzeringiz Web Assemblyni qo'llab-quvvatlamaydi\nva shuning uchun kodni ishga tushira olmaydi.\n\nSiz hali ham chapdagi kodni tahrirlashingiz mumkin."
}
