{
    "algorithmExplanationTitle": "¿Qué es un algoritmo?",
    "algorithmExplanation": "Un algoritmo es un conjunto de reglas que toma una o varias entradas, luego realiza cálculos internos y manipulaciones de datos y devuelve una salida o un conjunto de salidas. En resumen, los algoritmos facilitan la vida. Desde manipulaciones de datos complejas y hashes hasta aritmética simple, los algoritmos siguen un conjunto de pasos para producir un resultado útil. Un ejemplo de un algoritmo sería una función simple que toma dos valores de entrada, los agrega y devuelve su suma.",
    "helloAlgorithms": "¡Hola, algoritmos!",
    "searchesCategories": "Búsquedas",
    "aboutTextNavbar": "Acerca de",
    "donateButton": "Donar",
    "donateText": "Otra forma de apoyarnos es hacer una donación a través de [Liberapay]. Incluso una pequeña donación es muy apreciada. Al donar, significa que aprecias y te gusta nuestro trabajo. Si no te gusta nuestro trabajo, no hay necesidad de donar. Si donas, los miembros superiores podrán contribuir más a los proyectos de The Algorithms. Agradecemos las donaciones de todos, de todas partes, sin importar la cantidad.",
    "moreAlgorithmCard": "Más",
    "sourceCodeFooter": "Código fuente",
    "allAlgorithmsFooter": "Todos los algoritmos",
    "aboutUsFooter": "Acerca de",
    "algorithmExplaniationFooter": "¿Qué es un algoritmo?",
    "searchText": "Buscar cualquier algoritmo",
    "welcomeTitle": "Te damos la bienvenida a la biblioteca de algoritmos de código abierto más grande en GitHub",
    "imageProcessingCategories": "Procesamiento de imágenes",
    "basicMathCategories": "Matemáticas básicas",
    "dataStructuresCategories": "Estructuras de datos",
    "ciphersCategories": "Cifras",
    "dynamicProgrammingCategories": "Programación dinámica",
    "sortsCategories": "Ordenamiento",
    "topCategories": "Mejores categorias",
    "featuredAlgorithms": "Algoritmos destacados",
    "topAlgorithms": "Los mejores algoritmos",
    "donateTitle": "Donar",
    "contribute": "Te animamos a que contribuyas a estos repositorios. Si tienes un algoritmo que quieres añadir, un cambio que quieres hacer, o un error que quieres corregir, por favor hazlo. Pero antes de hacerlo, asegúrate de haber leído las directrices de contribución que se encuentran en CONTRIBUTING.md en el repositorio. Asegúrate de que eres respetuoso, útil, y que utilizas la última versión del lenguaje. Después de leer las directrices de contribución, por favor, haz un fork del repositorio, trabaja en tus cambios, y luego envíalos como un pull request. También puedes ayudar a traducir la pagina web usando [Weblate]. Si tienes algún lenguaje que quieras añadir, o cualquier cadena que quieras arreglar, eres bienvenido/a a contribuir.",
    "contributeTitle": "Contribuir",
    "programmingLanguages": "Admitimos muchos lenguajes de programación. Cada lenguaje tiene su repositorio en GitHub, en los que se almacena el código de todos los algoritmos. Esta es una lista de los lenguajes de programación actuales:",
    "programmingLanguagesTitle": "Lenguajes de programación",
    "aboutUs": "Somos un grupo de programadores que se ayudan mutuamente a construir cosas nuevas, ya sea escribiendo programas de cifrado complejos o cifrados simples. Nuestro objetivo es trabajar juntos para documentar y modelar algoritmos hermosos, útiles e interesantes usando código. Somos una comunidad de código abierto - cualquiera puede contribuir. Comprobamos el trabajo, nos comunicamos y colaboramos para resolver problemas. Nos esforzamos por ser acogedores, respetuosos, pero nos aseguramos de que nuestro código siga las últimas pautas de programación.",
    "aboutUsTitle": "Acerca de nosotros",
    "changeLanguageNavbar": "Cambiar idioma",
    "darkModeNavbar": "Modo oscuro",
    "lightModeNavbar": "Modo claro",
    "socialDiscord": "Hablar en Discord",
    "socialGitter": "Hablar en Gitter",
    "socialGithub": "Contribuye en GitHub",
    "socialTitle": "Conéctate con nosotros",
    "search": "Buscar",
    "home": "Inicio",
    "pageNotFound": "Pagina no encontrada",
    "languages_count": "{} más",
    "contact": "Contacto",
    "addExplanation": "Añadir una explicación para este algoritmo",
    "addExplanationInfo": "Este algoritmo aún no tiene una explicación. Las explicaciones se encuentran en el repositorio [Algorithms-Explanation]. Si desea agregar una explicación, forkea el repositorio y agregue la explicación como un archivo tipo Markdown ([ejemplo]). Una vez que haya terminado, puede abrir un pull request para aceptar su explicación.",
    "editPageHelp": "Si tiene dudas, o tiene algún problema, no dude en ir en nuestro servidor de [Discord], y preguntar por ayuda en nuestros canales disponibles.",
    "addImplementation": "Añadir una nueva implementación",
    "addImplementationInfo": "Para agregar una implementación en otro lenguaje, visite el repositorio de ese lenguaje, y siga las instrucciones dadas en el <code>README.md</code> y en el <code>CONTRIBUTING.md</code>.",
    "addImplementationMissing": "Aquí están los links a los repositorios que les falta la implementación de este algoritmo:",
    "editPageTranslate": "Traducir explicación",
    "editPageEdit": "Editar explicación",
    "editPageAddImplementation": "Añadir implementación",
    "editPageAddExplanation": "Añadir explicación",
    "viewOnGithub": "Ver en GitHub",
    "close": "Cerrar",
    "addTranslationInfo": "La explicación de este algoritmo aún no ha sido traducida a su idioma. Para traducir esta explicación, visite el repositorio [Algorithms-Explanation]. Haz un fork de este repositorio, y añade tu traducción como un nuevo archivo Markdown basado la version de inglés [<code>{ogFilename}</code>] en la carpeta correcta para tu idioma (<code>{locale}</code>). Cuando hayas traducido el archivo, puedes crear un nuevo pull request para que acepten tu traducción.",
    "addTranslation": "Traducir esta explicación",
    "langImplementation": "Implementación de {language}",
    "emptySearch": "Buscar un algoritmo",
    "noResults": "No se encuentran resultadas para",
    "languageMetaDescription": "Algoritmos implementados en {language}",
    "algorithmMetaDescriptionExplained": "{algorithm} explicado e implementado en {implementations}",
    "algorithmMetaDescription": "Implementación de {algorithm} en {implementations}",
    "indexMetaDescription": "Recurso de código abierto para aprender estructuras de datos y algoritmos y su implementación en cualquier lenguaje de programación",
    "analyticsText": "Utilizamos [Plausible Analytics] para recopilar datos de uso anónimos, y ver cuántas personas utilizan nuestro sitio web y cuáles son las funciones más utilizadas. El sitio web no hace ningún seguimiento de los visitantes individuales. Todos los datos son agregados. No se recogen datos personales ni se utilizan cookies. Puede ver todos los datos recogidos aquí:",
    "analyticsTitle": "Analíticas en este sitio",
    "analyticsFooter": "Analíticas"
}
