{
    "algorithmExplanationTitle": "쯈u칠 es un algoritmo?",
    "algorithmExplanation": "Un algoritmo es un conjunto de reglas que toma una o varias entradas, luego realiza c치lculos internos y manipulaciones de datos y devuelve una salida o un conjunto de salidas. En resumen, los algoritmos facilitan la vida. Desde manipulaciones de datos complejas y hashes hasta aritm칠tica simple, los algoritmos siguen un conjunto de pasos para producir un resultado 칰til. Un ejemplo de un algoritmo ser칤a una funci칩n simple que toma dos valores de entrada, los agrega y devuelve su suma.",
    "helloAlgorithms": "춰Hola, algoritmos!",
    "searchesCategories": "B칰squedas",
    "aboutTextNavbar": "Acerca de",
    "donateButton": "Donar",
    "donateText": "Otra forma de apoyarnos es hacer una donaci칩n a trav칠s de [Liberapay]. Incluso una peque침a donaci칩n es muy apreciada. Al donar, significa que aprecias y te gusta nuestro trabajo. Si no te gusta nuestro trabajo, no hay necesidad de donar. Si donas, los miembros superiores podr치n contribuir m치s a los proyectos de The Algorithms. Agradecemos las donaciones de todos, de todas partes, sin importar la cantidad.",
    "moreAlgorithmCard": "M치s",
    "sourceCodeFooter": "C칩digo fuente",
    "aboutUsFooter": "Acerca de",
    "algorithmExplaniationFooter": "쯈u칠 es un algoritmo?",
    "searchText": "Buscar cualquier algoritmo",
    "welcomeTitle": "Te damos la bienvenida a la biblioteca de algoritmos de c칩digo abierto m치s grande en GitHub",
    "imageProcessingCategories": "Procesamiento de im치genes",
    "basicMathCategories": "Matem치ticas b치sicas",
    "dataStructuresCategories": "Estructuras de datos",
    "ciphersCategories": "Cifras",
    "dynamicProgrammingCategories": "Programaci칩n din치mica",
    "sortsCategories": "Ordenamiento",
    "topCategories": "Mejores categorias",
    "featuredAlgorithms": "Algoritmos destacados",
    "topAlgorithms": "Los mejores algoritmos",
    "donateTitle": "Donar",
    "contribute": "Te animamos a que contribuyas a estos repositorios. Si tienes un algoritmo que quieres a침adir, un cambio que quieres hacer, o un error que quieres corregir, por favor hazlo. Pero antes de hacerlo, aseg칰rate de haber le칤do las directrices de contribuci칩n que se encuentran en CONTRIBUTING.md en el repositorio. Aseg칰rate de que eres respetuoso, 칰til, y que utilizas la 칰ltima versi칩n del lenguaje. Despu칠s de leer las directrices de contribuci칩n, por favor, haz un fork del repositorio, trabaja en tus cambios, y luego env칤alos como un pull request. Tambi칠n puedes ayudar a traducir la pagina web usando [Weblate]. Si tienes alg칰n lenguaje que quieras a침adir, o cualquier cadena que quieras arreglar, eres bienvenido/a a contribuir.",
    "contributeTitle": "Contribuir",
    "programmingLanguages": "Admitimos muchos lenguajes de programaci칩n. Cada lenguaje tiene su repositorio en GitHub, en los que se almacena el c칩digo de todos los algoritmos. Esta es una lista de los lenguajes de programaci칩n actuales:",
    "programmingLanguagesTitle": "Lenguajes de programaci칩n",
    "aboutUs": "Somos un grupo de programadores que se ayudan mutuamente a construir cosas nuevas, ya sea escribiendo programas de cifrado complejos o cifrados simples. Nuestro objetivo es trabajar juntos para documentar y modelar algoritmos hermosos, 칰tiles e interesantes usando c칩digo. Somos una comunidad de c칩digo abierto - cualquiera puede contribuir. Comprobamos el trabajo, nos comunicamos y colaboramos para resolver problemas. Nos esforzamos por ser acogedores, respetuosos, pero nos aseguramos de que nuestro c칩digo siga las 칰ltimas pautas de programaci칩n.",
    "aboutUsTitle": "Acerca de nosotros",
    "changeLanguageNavbar": "Cambiar idioma",
    "darkModeNavbar": "Modo oscuro",
    "lightModeNavbar": "Modo claro",
    "socialDiscord": "Hablar en Discord",
    "socialGitter": "Hablar en Gitter",
    "socialGithub": "Contribuye en GitHub",
    "socialTitle": "Con칠ctate con nosotros",
    "search": "Buscar",
    "home": "Inicio",
    "pageNotFound": "Pagina no encontrada",
    "languages_count": "{} m치s",
    "contact": "Contacto",
    "addExplanation": "A침adir una explicaci칩n para este algoritmo",
    "addExplanationInfo": "Este algoritmo a칰n no tiene una explicaci칩n. Las explicaciones se encuentran en el repositorio [Algorithms-Explanation]. Si desea agregar una explicaci칩n, forkea el repositorio y agregue la explicaci칩n como un archivo tipo Markdown ([ejemplo]). Una vez que haya terminado, puede abrir un pull request para aceptar su explicaci칩n.",
    "editPageHelp": "Si tiene dudas, o tiene alg칰n problema, no dude en ir en nuestro servidor de [Discord], y preguntar por ayuda en nuestros canales disponibles.",
    "addImplementation": "A침adir una nueva implementaci칩n",
    "addImplementationInfo": "Para agregar una implementaci칩n en otro lenguaje, visite el repositorio de ese lenguaje, y siga las instrucciones dadas en el <code>README.md</code> y en el <code>CONTRIBUTING.md</code>.",
    "addImplementationMissing": "Aqu칤 est치n los links a los repositorios que les falta la implementaci칩n de este algoritmo:",
    "editPageTranslate": "Traducir explicaci칩n",
    "editPageEdit": "Editar explicaci칩n",
    "editPageAddImplementation": "A침adir implementaci칩n",
    "editPageAddExplanation": "A침adir explicaci칩n",
    "viewOnGithub": "Ver en GitHub",
    "addTranslationInfo": "La explicaci칩n de este algoritmo a칰n no ha sido traducida a su idioma. Para traducir esta explicaci칩n, visite el repositorio [Algorithms-Explanation]. Haz un fork de este repositorio, y a침ade tu traducci칩n como un nuevo archivo Markdown basado la version de ingl칠s [<code>{ogFilename}</code>] en la carpeta correcta para tu idioma (<code>{locale}</code>). Cuando hayas traducido el archivo, puedes crear un nuevo pull request para que acepten tu traducci칩n.",
    "addTranslation": "Traducir esta explicaci칩n",
    "langImplementation": "Implementaci칩n de {language}",
    "emptySearch": "Buscar un algoritmo",
    "noResults": "No se encuentran resultadas para",
    "languageMetaDescription": "Algoritmos implementados en {language}",
    "algorithmMetaDescriptionExplained": "{algorithm} explicado e implementado en {implementations}",
    "algorithmMetaDescription": "Implementaci칩n de {algorithm} en {implementations}",
    "indexMetaDescription": "Recurso de c칩digo abierto para aprender estructuras de datos y algoritmos y su implementaci칩n en cualquier lenguaje de programaci칩n",
    "analyticsText": "Utilizamos [Plausible Analytics] para recopilar datos de uso an칩nimos, y ver cu치ntas personas utilizan nuestro sitio web y cu치les son las funciones m치s utilizadas. El sitio web no hace ning칰n seguimiento de los visitantes individuales. Todos los datos son agregados. No se recogen datos personales ni se utilizan cookies. Puede ver todos los datos recogidos aqu칤:",
    "analyticsTitle": "Anal칤ticas en este sitio",
    "analyticsFooter": "Anal칤ticas",
    "documentationLanguage": "Documentaci칩n",
    "githubRepository": "Repositorio de GitHub",
    "contributorsCommits": "{numberCommits} commits",
    "contributorsOneCommit": "1 commit",
    "contributorsTitle": "Contribuidores de {algorithm}",
    "contributorsMore": "Y {numberContributors} m치s contribuidores",
    "internalServerError": "Error interno del servidor",
    "playgroundUnsupported": "Su navegador no soporta Web Assembly\ny por lo tanto no puede ejecutar el c칩digo.\n\nA칰n as칤, puede editar el c칩digo a la izquierda.",
    "playgroundWelcome": "Bienvenido al c칩digo de la zona de juegos de Python 游녦",
    "playgroundRunCode": "Ejecutar c칩digo",
    "codeplayground": "C칩digo de la zona de juegos",
    "playgroundTryCode": "Prueba este c칩digo",
    "playgroundErrIdNotFound": "No se encontr칩 el ID del Playground",
    "playgroundErrInvalidLink": "El enlace del Playground no es v치lido",
    "playgroundLoadingPackage": "Cargando {package}",
    "aboutThisAlgorithm": "Acerca de este algoritmo",
    "playgroundReady": "춰Listo! Empieza editando el c칩digo en la\nlado izquierdo de la pantalla y haciendo clic en \"Ejecutar c칩digo\""
}
