{
    "algorithmExplanationTitle": "Was ist ein Algorithmus?",
    "algorithmExplanation": "Ein Algorithmus ist ein Satz von Regeln, der eine oder mehrere Eingaben entgegennimmt, dann innere Berechnungen und Datenmanipulationen durchführt und eine Ausgabe oder einen Satz von Ausgaben zurückgibt. Kurz gesagt: Algorithmen machen das Leben einfach. Von komplexen Datenmanipulationen und Hashes bis hin zu einfacher Arithmetik folgen Algorithmen einer Reihe von Schritten, um ein nützliches Ergebnis zu erzielen. Ein Beispiel für einen Algorithmus wäre eine einfache Funktion, die zwei Eingabewerte nimmt, sie addiert und ihre Summe zurückgibt.",
    "aboutUsTitle": "Über uns",
    "aboutUs": "Wir sind eine Gruppe von Programmierern, die sich gegenseitig helfen, neue Dinge zu bauen, sei es das Schreiben komplexer Verschlüsselungsprogramme oder einfacher Chiffren. Unser Ziel ist es, zusammenzuarbeiten, um schöne, hilfreiche und interessante Algorithmen mit Code zu dokumentieren und zu modellieren. Wir sind eine Open-Source-Gemeinschaft - jeder kann etwas beitragen. Wir überprüfen die Arbeit der anderen, kommunizieren und arbeiten zusammen, um Probleme zu lösen. Wir bemühen uns, einladend und respektvoll zu sein, und stellen dennoch sicher, dass unser Code den neuesten Programmierrichtlinien folgt.",
    "aboutTextNavbar": "Über uns",
    "searchText": "Suche nach einem Algorithmus",
    "welcomeTitle": "Willkommen bei der größten Open-Source Algorithmen-Bibliothek auf GitHub",
    "moreAlgorithmCard": "Mehr",
    "donateButton": "Spenden",
    "sourceCodeFooter": "Quellcode",
    "aboutUsFooter": "Über uns",
    "algorithmExplaniationFooter": "Was ist ein Algorithmus?",
    "topCategories": "Top Kategorien",
    "featuredAlgorithms": "Ausgewählte Algorithmen",
    "topAlgorithms": "Top Algorithmen",
    "donateTitle": "Spenden",
    "contributeTitle": "Beitragen",
    "programmingLanguages": "Wir unterstützen viele Programmiersprachen. Jede Sprache hat ihr eigenes GitHub-Repository, in dem der gesamte Code für die Algorithmen gespeichert ist. Die folgenden Programmiersprachen werden von uns angeboten:",
    "programmingLanguagesTitle": "Programmiersprachen",
    "changeLanguageNavbar": "Sprache ändern",
    "darkModeNavbar": "Dunkles Theme",
    "lightModeNavbar": "Helles Theme",
    "helloAlgorithms": "Hallo, Algorithmen!",
    "imageProcessingCategories": "Bildverarbeitung",
    "basicMathCategories": "Grundlegende Mathematik",
    "dataStructuresCategories": "Datenstrukturen",
    "ciphersCategories": "Chiffren",
    "dynamicProgrammingCategories": "Dynamisches Programmieren",
    "searchesCategories": "Suchalgorithmen",
    "sortsCategories": "Sortieralgorithmen",
    "donateText": "Du kannst unsere Open-Source-Arbeit über [Liberapay] unterstützen. Wenn du uns spendest, erhältst du eine besondere Rolle auf unserem Discord-Server und hilfst uns, dieses Projekt am Leben zu erhalten. Vielen Dank für deine Unterstützung, egal ob du spendest oder nicht.",
    "contribute": "Möchtest du mitmachen? Es gibt viele Möglichkeiten, etwas beizutragen, wie z.B. übersetzen, (Rechtschreib-)Fehler korrigieren, den Code verbessern, usw.. Wenn du gerade erst anfängst, schau nach Themen mit dem Label `good first issue`.",
    "socialTitle": "In Kontakt bleiben",
    "socialDiscord": "Chat auf Discord",
    "socialGitter": "Chat auf Gitter",
    "socialGithub": "Auf GitHub beitragen",
    "search": "Suche",
    "home": "Zurück",
    "pageNotFound": "Seite nicht gefunden",
    "languages_count": "Und {} weitere",
    "contact": "Kontakt",
    "viewOnGithub": "Auf GitHub ansehen",
    "addTranslationInfo": "Die Erklärung zu diesem Algorithmus wurde noch nicht in Ihre Sprache übersetzt. Die Übersetzungen für die Erklärungstexte befinden sich in dem [Algorithms-Explanation] Repository. Um diese Erklärung zu übersetzen, muss nun also dieses Repository geforkt werden und als neue Markdown-Datei basierend auf dem englischen [<code>{ogFilename}</code>] in den Ordner <code>{locale}</code> hinzugefügt werden. Wenn die Datei übersetzt wurde, kann ein Pull-Request geöffnet werden, um die Übersetzung zu mergen.",
    "addTranslation": "Diese Erklärung Übersetzen",
    "addImplementationMissing": "Hier sind Links zu Repositories, in denen der Algorithmus noch nicht implementiert wurde:",
    "addImplementationInfo": "Um eine Implementierung in einer anderen Programmiersprache hinzuzufügen, kann das Repository für diese Sprache besucht werden. In den Dateien <code>README.md</code> und <code>CONTRIBUTING.md</code> finden sich Anweisungen, wie Algorithmen in den jeweiligen Repositories hinzugefügt werden können.",
    "addImplementation": "Eine weitere Implementation hinzufügen",
    "editPageHelp": "Treten irgendwelche Fragen auf, helfen wir gerne auf unserem [Discord-Server] weiter.",
    "addExplanationInfo": "Für diesen Algorithmus gibt es noch keinen Erklärungstext. Die Erklärungen befinden sich im Repository [Algorithms-Explanations]. Um eine Erklärung hinzuzufügen, muss dieses Repository geforkt werden und die Erklärung kann dann als Markdown-Datei hinzugefügt werden ([Beispiel]). Wenn das fertig ist, kann ein Pull-Request geöffnet werden, um die Erklärung zu mergen.",
    "addExplanation": "Erklärung für diesen Algorithmus hinzufügen",
    "editPageTranslate": "Erklärung übersetzen",
    "editPageAddExplanation": "Erklärung hinzufügen",
    "editPageAddImplementation": "Implementation hinzufügen",
    "editPageEdit": "Seite Bearbeiten",
    "langImplementation": "{language} Implementierung",
    "emptySearch": "Suche ein Algorithmus",
    "noResults": "Keine Resultate für",
    "languageMetaDescription": "Algorithmen implementiert in {language}",
    "algorithmMetaDescriptionExplained": "{algorithm} erklärt und umgesetzt in {implementations}",
    "algorithmMetaDescription": "{algorithm} implementiert in {implementations}",
    "indexMetaDescription": "Open Source-Ressource zum Erlernen von Datenstrukturen und Algorithmen und deren Implementierung in einer beliebigen Programmiersprache",
    "contributorsCommits": "{numberCommits} Commits",
    "contributorsOneCommit": "1 Commit",
    "contributorsTitle": "Mitwirkende an \"{algorithm}\"",
    "contributorsMore": "und {numberContributors} weitere Mitwirkende",
    "documentationLanguage": "Dokumentation",
    "githubRepository": "GitHub-Repository",
    "analyticsText": "Wir verwenden [Plausible Analytics] auf dieser Website, um anonyme Nutzungsdaten zu sammeln und so zu sehen, wie viele Personen unsere Website nutzen und welche Funktionen am meisten genutzt werden. Die Website verfolgt in keiner Weise einzelne Besucher. Alle Daten werden nur in aggregierter Form erfasst. Es werden keine persönlichen Daten gesammelt, und es werden keine Cookies verwendet. Alle gesammelten Daten können hier eingesehen werden:",
    "analyticsTitle": "Analytics auf dieser Website",
    "analyticsFooter": "Analytics",
    "playgroundUnsupported": "Ihr Browser unterstützt keine Web Assembly\nund kann daher den Code nicht ausführen.\n\nSie können den Code auf der linken Seite\ntrotzdem bearbeiten.",
    "playgroundWelcome": "Willkommen auf dem Code Playground von TheAlgorithms 👋",
    "playgroundRunCode": "Code ausführen",
    "codeplayground": "Code-Spielplatz",
    "internalServerError": "Interner Server-Fehler",
    "playgroundLoadingPackage": "{package} wird geladen",
    "playgroundReady": "Bereit! Um zu beginnen, einfach den Code auf der linken Seite\nbearbeiten und dann auf den Knopf \"Code ausführen\" klicken",
    "playgroundTryCode": "Diesen Code ausprobieren",
    "playgroundErrIdNotFound": "Die Playground-ID wurde nicht gefunden",
    "playgroundErrInvalidLink": "Der Playground-Link ist ungültig",
    "aboutThisAlgorithm": "Über diesen Algorithmus",
    "fullscreen": "Vollbild"
}
