{
    "featuredAlgorithms": "विशेष रुप से प्रदर्शित एल्गोरिथ्म",
    "topAlgorithms": "शीर्ष एल्गोरिदम",
    "donateTitle": "दान करिए",
    "contributeTitle": "योगदान",
    "programmingLanguages": "हम बहुत सारी प्रोग्रामिंग भाषाओं को सहयोग देते हैं| हर भाषा की खुद की गितहब रिपॉजिटरी है जहां पर कलन विधिओं के लिए सारा कोड रखा जाता है| मौजूदी प्रोग्रामिंग भाषाओं की सूची:",
    "programmingLanguagesTitle": "प्रोग्रामिंग भाषाएँ",
    "aboutUsTitle": "हमारे बारे में",
    "algorithmExplanationTitle": "कलन विधि क्या है?",
    "editPageAddExplanation": "व्याख्या जोड़े",
    "editPageTranslate": "व्याख्या अनुवादन करे",
    "addExplanation": "इस अल्गोरिथम की व्याख्या जोड़े",
    "addImplementation": "कोई और कार्यान्वयन जोड़े",
    "addImplementationInfo": "किसी अन्य भाषा में कार्यान्वयन जोड़ने के लिए, कृपया उस भाषा के भंडार पर जाएं और README.md और CONTRIBUTING.md में दिए गए निर्देशों का पालन करें।",
    "topCategories": "शीर्ष श्रेणियां",
    "sortsCategories": "छंटनी",
    "searchesCategories": "खोज",
    "dynamicProgrammingCategories": "गत्यात्मिक कार्यक्रम निर्माण",
    "ciphersCategories": "गूढ़लेख",
    "dataStructuresCategories": "आंकड़ों की संरचना",
    "basicMathCategories": "मूलभूत गणित",
    "imageProcessingCategories": "छवि प्रसंस्करण",
    "helloAlgorithms": "नमस्ते, कलन विधि!",
    "welcomeTitle": "GitHub की सबसे बड़ी विवृत -स्त्रोत एल्गोरिथम संग्रालय में आपका स्वागत है",
    "searchText": "कोई भी अल्गोरिथम ढूंढें",
    "socialDiscord": "Discord पर बात करे",
    "sourceCodeFooter": "स्रोत कोड",
    "donateButton": "दान करे",
    "algorithmExplaniationFooter": "अल्गोरिथम क्या है?",
    "aboutUsFooter": "हमारे बारे में",
    "moreAlgorithmCard": "अधिक",
    "lightModeNavbar": "रोशन प्रणाली",
    "changeLanguageNavbar": "भाषा बदले",
    "socialTitle": "हमसे जुड़े",
    "socialGithub": "GitHub पर योगदान दे",
    "socialGitter": "Gitter पर बात करे",
    "pageNotFound": "पृष्ठ नहीं मिला",
    "home": "मुख्य पृष्ठ",
    "search": "ढूंढें",
    "langImplementation": "{ भाषा } कार्यान्वयन",
    "contact": "संपर्क करें",
    "editPageEdit": "पृष्ठ संपादित करें",
    "editPageAddImplementation": "कार्यान्वयन जोड़े",
    "indexMetaDescription": "डेटा संरचना और एल्गोरिदम सीखने और किसी भी प्रोग्रामिंग भाषा में उनके कार्यान्वयन के लिए विवृत स्रोत संसाधन",
    "algorithmMetaDescription": "{algorithm} कार्यान्वित है {implementations} में",
    "aboutUs": "हम प्रोग्रामर्स का एक समूह हैं जो एक-दूसरे को नई चीजें बनाने में मदद करते हैं, चाहे वह जटिल एन्क्रिप्शन प्रोग्राम लिखना हो, या साधारण गूढ़लेख। हमारा लक्ष्य कंप्यूटर कोड का उपयोग करके सुंदर, सहायक और रोचक एल्गोरिदमो का आलेखन और प्रतिरूपण करने के लिए मिलकर काम करना है। हम एक विवृत स्रोत समुदाय हैं - यहाँ कोई भी योगदान दे सकता है। हम समस्याओं को हल करने के लिए एक दूसरे के काम की जांच करते हैं तथा संवाद और सहयोग करते हैं। हम सम्मानजनक स्वागत करने का प्रयास करते हैं, पर साथ ही साथ यह भी सुनिश्चित करते हैं कि हमारा कोड नवीनतम प्रोग्रामिंग दिशानिर्देशों का पालन करता है।",
    "algorithmExplanation": "एक एल्गोरिथ्म नियमों का एक समूह है जो एक या अधिक इनपुट लेता है, फिर आंतरिक गणना और डेटा जोड़तोड़ करता है और आउटपुट या आउटपुट का एक सेट देता है। संक्षेप में, एल्गोरिदम जीवन को आसान बनाते हैं। जटिल डेटा जोड़तोड़ और हैश से लेकर सरल अंकगणित तक, एल्गोरिदम एक उपयोगी परिणाम उत्पन्न करने के लिए चरणों के एक सेट का पालन करते हैं। एल्गोरिथ्म का एक उदाहरण एक साधारण फ़ंक्शन होगा जो दो इनपुट मान लेता है, उन्हें एक साथ जोड़ता है, और उनका योग देता है।",
    "addImplementationMissing": "यहां उन रिपॉजिटरी के लिंक दिए गए हैं जो अभी भी कार्यान्वित हैं:",
    "contribute": "हम आपको इन कोड भंडारों में योगदान करने के लिए प्रोत्साहित करते हैं। यदि आपके पास कोई एल्गोरिथम है जिसे आप जोड़ना चाहते हैं, कोई परिवर्तन जो आप करना चाहते हैं, या कोई प्रोग्राम में त्रुटि जिसे आप ठीक करना चाहते हैं, तो कृपया ऐसा करें। लेकिन ऐसा करने से पहले, सुनिश्चित करें कि आपने रिपॉजिटरी में CONTRIBUTING.md में मिले योगदान दिशानिर्देशों को पढ़ लिया है। सुनिश्चित करें कि आप सम्मानजनक, उपयोगी और भाषा के नवीनतम संस्करण का उपयोग कर रहे हैं। योगदान दिशानिर्देशों को पढ़ने के बाद, कृपया रिपॉजिटरी को फोर्क करें, अपने परिवर्तनों पर काम करें और फिर उन्हें पुल अनुरोध के रूप में जमा करें। आप [वेबलेट] का उपयोग करके वेबसाइट का अनुवाद करने में भी हमारी मदद कर सकते हैं। यदि आपके पास कोई अन्य भाषा है जिसे आप जोड़ना चाहते हैं, या कोई स्ट्रिंग जिसे आप ठीक करना चाहते हैं, तो योगदान करने के लिए आपका स्वागत है।",
    "donateText": "आप Liberapay के माध्यम से दान करके भी आप हमारा समर्थन कर सकते हैं । एक छोटा सा दान भी बहुत सराहनीय है । दान करने का मतलब है कि आप हमारे काम की सराहना करते हैं और पसंद करते हैं। अगर आपको हमारा काम पसंद नहीं है, तो दान करने की कोई जरूरत नहीं है। यदि आप दान करते हैं, तो शीर्ष सदस्य इस परियोजना में योगदान करने में और सक्षम होंगे। हम सभी से, हर जगह से दान की सराहना करते हैं, चाहे वह कोई भी राशि हो ।",
    "addExplanationInfo": "इस एल्गोरिथ्म में अभी तक कोई व्याख्या नहीं है। व्याख्या [एल्गोरिदम-स्पष्टीकरण] भंडार में स्थित हैं। यदि आप एक व्याख्या जोड़ना चाहते हैं, तो इस भंडार को फोर्क करें और व्याख्या को मार्कडाउन फ़ाइल ([उदाहरण]) के रूप में जोड़ें। एक बार जब आप अपना काम समाप्त कर लें, तो आप अपनी व्याख्या को मर्ज करने के लिए एक पुल अनुरोध खोल सकते हैं।",
    "editPageHelp": "यदि आपको कोई समस्या है, तो बेझिझक हमारे [डिसॉर्ड] सर्वर पर जाएं, और सहायता मांगें।",
    "languageMetaDescription": "अल्गोरिथम कार्यान्वित है {language} में",
    "viewOnGithub": "GitHub पर देखे",
    "addTranslation": "इस व्याख्या का अनुवादन करे",
    "addTranslationInfo": "इस एल्गोरिथम की व्याख्या का अभी तक आपकी भाषा में अनुवाद नहीं किया गया है। इस व्याख्या का अनुवाद करने के लिए, कृपया [एल्गोरिदम-स्पष्टीकरण] रिपॉजिटरी पर जाएँ। इस रिपॉजिटरी को फोर्क करें और अपने स्थान के लिए सही फ़ोल्डर में अंग्रेज़ी [<code>{ogFilename}</code>] पर आधारित एक नई मार्कडाउन फ़ाइल के रूप में अपना अनुवाद जोड़ें (<code>{locale}</code>)। जब आपने फ़ाइल का अनुवाद कर लिया है, तो आप अपने अनुवाद को मर्ज करने के लिए एक नया पुल अनुरोध बना सकते हैं।",
    "aboutTextNavbar": "विषय में",
    "darkModeNavbar": "अँधेरा प्रणाली",
    "languages_count": "{} और जोड़ें",
    "algorithmMetaDescriptionExplained": "{algorithm} को {implementations} में समझाया और लागू किया गया",
    "noResults": "कोई परिणाम नहीं है इसके लिए",
    "internalServerError": "आंतरिक सर्वर त्रुटि",
    "codeplayground": "कोड खेल का मैदान",
    "playgroundRunCode": "कोड चलाओ",
    "playgroundWelcome": "एल्गोरिदम के कोड के मैदान में आपका स्वागत है",
    "playgroundReady": "तैयार! पर कोड संपादित करके प्रारंभ करें\nस्क्रीन के बाईं ओर और \"रन कोड\" पर क्लिक करें",
    "analyticsFooter": "एल्गोरिथम खोजें",
    "emptySearch": "एल्गोरिथम खोजें",
    "analyticsTitle": "इस साइट पर विश्लेषिकी",
    "githubRepository": "गिटहब भंडार",
    "documentationLanguage": "प्रलेखन",
    "contributorsOneCommit": "1 प्रतिबद्ध",
    "contributorsCommits": "{नंबर कमिट्स} कमिट करता है",
    "contributorsMore": "और {numberContributors} और योगदानकर्ता",
    "contributorsTitle": "{एल्गोरिदम} योगदानकर्ता",
    "playgroundTryCode": "इस कोड को आजमाएं",
    "playgroundUnsupported": "आपका ब्राउज़र वेब असेंबली का समर्थन नहीं करता\nऔर इस प्रकार कोड नहीं चला सकता।\n\nआप अभी भी बाईं ओर दिए गए कोड को संपादित कर सकते हैं।",
    "playgroundErrIdNotFound": "मैदान आईडी नहीं मिला",
    "playgroundErrInvalidLink": "मैदान लिंक अमान्य है",
    "fullscreen": "पूर्ण स्क्रीन",
    "aboutThisAlgorithm": "इस एल्गोरिथम के बारे में",
    "playgroundLoadingPackage": "लोड हो रहा है {पैकेज}",
    "analyticsText": "हम यह देखने के लिए कि कितने लोग हमारी वेबसाइट का उपयोग कर रहे हैं, और कौन सी सबसे अधिक उपयोग की जाने वाली विशेषताएं हैं, यह देखने के लिए हम अज्ञात उपयोग डेटा एकत्र करने के लिए इस साइट पर {प्रशंसनीय विश्लेषिकी} का उपयोग करते हैं। वेबसाइट किसी भी तरह से व्यक्तिगत आगंतुकों को ट्रैक नहीं करती है। सभी डेटा केवल कुल में है। कोई व्यक्तिगत डेटा एकत्र नहीं किया जाता है, और कोई कुकीज़ का उपयोग नहीं किया जाता है। आप यहां एकत्रित सभी डेटा देख सकते हैं:"
}
