{
    "analyticsText": "Utilizziamo [Plausible Analytics] su questo sito per raccogliere dati di utilizzo anonimi per vedere quante persone stanno utilizzando il nostro sito web e quali sono le funzionalità più utilizzate. Il sito web non tiene traccia in alcun modo dei singoli visitatori. Tutti i dati sono solo aggregati. Non vengono raccolti dati personali e non vengono utilizzati cookie. Puoi visualizzare tutti i dati raccolti qui:",
    "indexMetaDescription": "Risorsa Open-Source per l'apprendimento di Strutture Dati &amp; Algoritmi e la loro implementazione in qualsiasi linguaggio di programmazione",
    "addTranslationInfo": "La spiegazione di questo algoritmo non è stata ancora tradotta nella tua lingua. Per tradurre questa spiegazione, visita il repository [Algorithms-Explanation]. Crea un fork di questo repository e aggiungi la tua traduzione come file Markdown basato sulla versione in inglese [<code>{ogFilename}</code>] nella cartella corretta per la tua lingua (<code>{locale}</code>). Dopo aver tradotto il file, puoi creare una pull request per aggiungere la tua traduzione.",
    "addImplementationInfo": "Per aggiungere un'implementazione in un altro linguaggio, visita il repository di quel linguaggio e segui le istruzioni fornite nel <code>README.md</code> e nel <code>CONTRIBUTING.md</code>.",
    "editPageHelp": "In caso di problemi, non esitare ad andare sul nostro server [Discord] e chiedere aiuto.",
    "addExplanationInfo": "Questo algoritmo non ha ancora una spiegazione. Le spiegazioni si trovano nel repository [Algorithms-Explanations]. Se vuoi aggiungere una spiegazione, effettua un fork di questo repository e aggiungi la spiegazione come file markdown ([example]). Una volta terminato, puoi aprire una pull request per aggiungere la tua spiegazione.",
    "darkModeNavbar": "Tema scuro",
    "lightModeNavbar": "Tema chiaro",
    "donateText": "Un altro modo per sostenerci è fare una donazione tramite [Liberapay]. Anche una piccola donazione è molto apprezzata. Donando, significa che apprezzi e ti piace il nostro lavoro. Se non ti piace il nostro lavoro, non c'è bisogno di donare. Se fai una donazione, i membri migliori potranno contribuire ulteriormente ai progetti di The Algorithms. Apprezziamo le donazioni da parte di tutti, ovunque, indipendentemente dall'importo.",
    "welcomeTitle": "Benvenuto nella più grande libreria open-source di algoritmi di GitHub",
    "contribute": "Ti invitiamo a contribuire a questi repository. Se hai un algoritmo che vuoi aggiungere, una modifica che vuoi apportare o un bug che vuoi correggere, fallo. Ma prima di farlo, assicurati di aver letto le linee guida trovate in CONTRIBUTING.md nel repository. Assicurati di essere rispettoso, disponibile e di utilizzare l'ultima versione del linguaggio. Dopo aver letto le linee guida, effettua il fork del repository, lavora sulle modifiche e quindi inviale come pull request. Puoi anche aiutarci a tradurre il sito web utilizzando [Weblate]. Se hai altre lingue che desideri aggiungere o eventuali stringhe che desideri correggere, puoi contribuire.",
    "programmingLanguages": "Supportiamo molti linguaggi di programmazione. Ogni linguaggio ha il proprio repository GitHub in cui è archiviato tutto il codice per gli algoritmi. Ecco un elenco degli attuali linguaggi di programmazione:",
    "contributorsCommits": "{numberCommits} commit",
    "internalServerError": "Errore interno",
    "contributorsOneCommit": "1 commit",
    "contributorsTitle": "{algorithm} Collaboratori",
    "contributorsMore": "ed altri {numberContributors} collaboratori",
    "documentationLanguage": "Documentazione",
    "githubRepository": "Repository GitHub",
    "analyticsTitle": "Analisi su questo sito",
    "analyticsFooter": "Analisi",
    "emptySearch": "Ricerca un algoritmo",
    "noResults": "Nessun risultato per",
    "languageMetaDescription": "Algoritmi implementati in {language}",
    "algorithmMetaDescriptionExplained": "{algorithm} spiegato ed implementato in {implementations}",
    "algorithmMetaDescription": "{algorithm} implementato in {implementations}",
    "viewOnGithub": "Vedi su GitHub",
    "addTranslation": "Traduci questa spiegazione",
    "addImplementationMissing": "Qua ci sono i link alle altre repositories a cui mancano alcune implementazioni:",
    "addImplementation": "Aggiungi un'altra implementazione",
    "addExplanation": "Aggiungi una spiegazione per questo algoritmo",
    "editPageTranslate": "Traduci spiegazione",
    "editPageAddExplanation": "Aggiungi spiegazione",
    "editPageAddImplementation": "Aggiungi implementazione",
    "editPageEdit": "Modifica",
    "contact": "Contatti",
    "langImplementation": "Implementazione in {language}",
    "languages_count": "Ed altri {}",
    "search": "Ricerca",
    "home": "Home",
    "pageNotFound": "Pagina non trovata",
    "socialDiscord": "Seguici su Discord",
    "socialGitter": "Seguici su Gitter",
    "socialGithub": "Contribuisci su GitHub",
    "socialTitle": "Seguici",
    "changeLanguageNavbar": "Cambia lingua",
    "moreAlgorithmCard": "Altro",
    "donateButton": "Donazioni",
    "sourceCodeFooter": "Codice sorgente",
    "aboutUsFooter": "Chi siamo",
    "algorithmExplaniationFooter": "Cos'è un algoritmo?",
    "aboutTextNavbar": "Chi siamo",
    "searchText": "Cerca un algoritmo",
    "helloAlgorithms": "Ciao, algoritmi!",
    "imageProcessingCategories": "Elaborazione delle immagini",
    "basicMathCategories": "Matematica base",
    "dataStructuresCategories": "Strutture dati",
    "ciphersCategories": "Cifrari",
    "dynamicProgrammingCategories": "Programmazione dinamica",
    "sortsCategories": "Ordinamento",
    "searchesCategories": "Ricerche",
    "topCategories": "Principali categorie",
    "featuredAlgorithms": "Algoritmi in primo piano",
    "topAlgorithms": "Principali algoritmi",
    "donateTitle": "Donazioni",
    "contributeTitle": "Contribuisci",
    "programmingLanguagesTitle": "Linguaggi di programmazione",
    "aboutUs": "Siamo un gruppo di programmatori che si aiutano nello sviluppare nuovi progetti, che siano complessi programmi di criptazione o semplici cifrari. Il nostro obiettivo è lavorare assieme per documentare e modellizzare algoritmi belli, utili ed interessanti. Siamo una comunità open-source a cui chiunque può contribuire. Controlliamo il lavoro altrui, comunichiamo e collaboriamo per risolvere i problemi. Ci sforziamo di essere accoglienti e rispettosi e ci assicuriamo che il nostro codice segua le ultime linee guida di programmazione.",
    "aboutUsTitle": "Chi siamo",
    "algorithmExplanation": "Un algoritmo è un insieme di regole che prendono uno o più input, vi eseguono calcoli o li manipolano e restituiscono un risultato od un insieme di risultati. In breve, gli algoritmi rendono la vita facile. Da complesse manipolazioni di dati e hashes, a semplice aritmetica, gli algoritmi seguono un insieme di passi per produrre un risultato utile. Un esempio di algoritmo sarebbe una semplice funzione che prende in input due valori, li somma e ne ritorna il risultato.",
    "algorithmExplanationTitle": "Cos'è un Algoritmo?"
}
