{
  "topCategories": "Найпоширеніші категорії",
  "topAlgorithms": "Найпоширеніші алгоритми",
  "searchText": "Пошук будь-якого алгоритму",
  "search": "Пошук",
  "home": "Домівка",
  "pageNotFound": "Сторінку не знайдено",
  "socialDiscord": "Чат у Discord",
  "socialGitter": "Чат у Gitter",
  "socialGithub": "Зробити внесок на GitHub",
  "socialTitle": "Зв'яжіться з нами",
  "changeLanguageNavbar": "Змінити мову",
  "darkModeNavbar": "Темна тема",
  "lightModeNavbar": "Світла тема",
  "moreAlgorithmCard": "Докладніше",
  "donateText": "Інший спосіб підтримати нас - зробити пожертвування через [Liberapay]. Навіть невеличкий внесок стане нам в пригоді. Це означатиме, що ви цінуєте і любите нашу роботу. Якщо вам не подобається наша робота, нема потреби робити пожертвування. Якщо ви зробите пожертвування, то найкращі учасники зможуть надалі поліпшувати проєкти The Algorithms. Ми цінуємо пожертви від всіх і звідусіль, незалежно від сум.",
  "donateButton": "Пожертвувати",
  "sourceCodeFooter": "Джерельний код",
  "aboutUsFooter": "Про нас",
  "aboutTextNavbar": "Про Algorithms",
  "algorithmExplaniationFooter": "Що таке алгоритм?",
  "welcomeTitle": "Ласкаво просимо до найбільшої бібліотеки відкритоджерельних алгоритмів GitHub",
  "helloAlgorithms": "Привіт, алгоритми!",
  "imageProcessingCategories": "Обробка зображень",
  "basicMathCategories": "Загальна математика",
  "dataStructuresCategories": "Структури даних",
  "ciphersCategories": "Шифри",
  "dynamicProgrammingCategories": "Динамічне програмування",
  "searchesCategories": "Пошуки",
  "sortsCategories": "Упорядкування",
  "featuredAlgorithms": "Пораджені алгоритми",
  "donateTitle": "Пожертвувати",
  "contribute": "Ми закликаємо вас робити свій внесок в ці репозиторії. Якщо у вас є алгоритм, який ви хочете додати, зміна, яку ви хочете зробити, або помилка, яку ви хочете виправити, будь ласка, зробіть це. Але перш ніж це зробити, переконайтеся, що ви прочитали вказівки зі внесення змін до головного репозиторію, які можна знайти у CONTRIBUTING.md. Переконайтеся, що ви досвідчені, робите все якісно та використовуєте останню версію мови програмування. Після прочитання посібника з внесення змін, будь ласка, вставте репозиторій в гілку, попрацюйте над своїми змінами, а потім надішліть їх у вигляді настійного запиту (pull request). Ви також можете допомогти нам перекласти вебсайт, використовуючи [Weblate]. Якщо у вас є інші мови, які ви хочете додати, або рядки, які ви хочете виправити, ви можете зробити внесок.",
  "contributeTitle": "Зробити внесок",
  "programmingLanguages": "Ми підтримуємо багато мов програмування. Кожна мова має свій власний репозиторій GitHub, в якому зберігається весь код алгоритмів. Ось список поточних мов програмування:",
  "programmingLanguagesTitle": "Мови програмування",
  "aboutUs": "Ми - група програмістів, які допомагають один одному будувати нові речі, чи то написання складних застосунків шифрування або прості шифри. Наша ціль - спільна робота з документування та моделювання красивих, корисних і цікавих алгоритмів з використанням коду. Ми - спільнота з відкритоджерельним кодом - будь-хто може зробити свій внесок. Ми перевіряємо роботу один одного, спілкуємося і співпрацюємо для розв'язання труднощів. Ми прагнемо бути гостинними, ввічливими, але водночас стежимо за тим, щоб наш код відповідав найостаннішим вимогам сучасного програмування.",
  "aboutUsTitle": "Про нас",
  "algorithmExplanation": "Алгоритм - це набір правил, який приймає один або кілька входів, потім виконує внутрішні обчислення і маніпуляції з даними та повертає вихід або набір виходів. Словом, алгоритми полегшують життя. Від складних маніпуляцій з даними та гешами до простої аритметики, алгоритми виконують ряд кроків для отримання корисного підсумку. Одним із прикладів алгоритму може служити проста функція, яка бере два вхідних значення, складає їх разом і повертає їх суму.",
  "algorithmExplanationTitle": "Що таке алгоритм?"
}
