{
    "programmingLanguagesTitle": "Програмски јазици",
    "basicMathCategories": "Основна Математика",
    "dynamicProgrammingCategories": "Динамичко програмирање",
    "dataStructuresCategories": "Податочни структури",
    "welcomeTitle": "Добродојдовте во најголемата open-source библиотека за алгоритми на GitHub",
    "searchText": "Пребарај за некој алгоритам",
    "aboutTextNavbar": "За нас",
    "algorithmExplaniationFooter": "Што е алгоритам?",
    "aboutUsFooter": "За нас",
    "sourceCodeFooter": "Изворен код",
    "donateButton": "Донирај",
    "moreAlgorithmCard": "Повеќе",
    "lightModeNavbar": "Светла тема",
    "darkModeNavbar": "Темна тема",
    "changeLanguageNavbar": "Смени јазик",
    "imageProcessingCategories": "Обработка на Слика",
    "helloAlgorithms": "Здраво алгоритми!",
    "home": "Почетна",
    "socialGithub": "Придонеси на GitHub",
    "socialGitter": "Допишувај се на Gitter",
    "search": "Барај",
    "languages_count": "Уште {} повеќе",
    "langImplementation": "{language} имплементација",
    "editPageAddExplanation": "Додај објаснување",
    "editPageTranslate": "Преведи објаснување",
    "addExplanation": "Додади објаснување за алгоритмот",
    "editPageHelp": "Ако имаш било какви проблеми, слободно можеш да прашаш на нашиот [Discord] сервер.",
    "addImplementation": "Додај друга имплементација",
    "addImplementationInfo": "За да додадеш имплементација во друг јазик, посети го репозиториумот за тој јазик и следи ги упатствата дадени во <code>README.md</code> and <code>CONTRIBUTING.md</code> датотеките.",
    "addImplementationMissing": "Ова се врски до репозиторијата за кои недостасува имплементација:",
    "addTranslation": "Преведи го објаснувањево",
    "viewOnGithub": "Погледни го на GitHub",
    "algorithmExplanationTitle": "Што е алгоритам?",
    "aboutUsTitle": "За нас",
    "contributeTitle": "Придонеси",
    "donateTitle": "Донирај",
    "donateText": "Друг начин на кој што можеш да нѐ поддржеш е преку [Liberapay]. Секоја донација е добредојдена. Донирањето значи дека ти се допаѓа, и дека ја цениш нашата работа. Ако не го сакаш тоа што го работиме, нема потреба да донираш. Ако донираш, тогаш нашите најдобри членови ќе можат дополнително да придонесуваат за The Algorithms проекти. Ги цениме донациите од секого, и од секаде, без разлика на износот.",
    "socialTitle": "Поврзи се со нас",
    "socialDiscord": "Допишувај се на Discord",
    "contact": "Контакт",
    "pageNotFound": "Страната не е најдена",
    "editPageAddImplementation": "Додај имплементација",
    "editPageEdit": "Уреди ја страната",
    "addExplanationInfo": "Алгоритмов сѐ уште нема објаснување. Објаснувањата се наоѓаат во [Algorithms-Explanations] репозиториумот. Ако сакаш да додадеш објаснување, направи fork на овој репозиториум и додај го објаснувањето како markdown датотека ([example]). Откако ќе завршиш, отвори pull request кој ќе го содржи твоето објаснување.",
    "addTranslationInfo": "Објаснувањето за алгоритмов сѐ уште не е преведено во твојот јазик. За да го преведеш ова објаснување, можеш да го посетиш [Algorithms-Explanation] репозиториумот. Направи своја копија (Fork), додај го своето објаснување како Markdown датотека основана на English [<code>{ogFilename}</code>] во соодвениот директориум за твојот јазик, т.е., locale (<code>{locale}</code>). Кога ќе го преведеш објаснувањето, направи pull request за да направиш merge со главниот репозиториум.",
    "algorithmExplanation": "Алгоритам е множество на правила кој прима еден или повеже влезови, по што извршува низа внатрешни пресметки и податочни операции, и враќа еден или множество од повеќе излези. На кратко, алгоритмите го олеснуваат животот. Од сложени податочни операции, како хеш (hash), до едноставни аритметички, алгоритмите следат множество чекори за да создадат корисен резултат. Пример за алгоритам би била едноставна функција, која на влез зема две вредности, ги собира, и го враќа нивниот збир.",
    "programmingLanguages": "Поддржуваме многу програмски јазици. Секој јазик има свој GitHub репозиториум каде што е зачуван кодот за алгоритмите. Тука има список на тековните програмски јазици:",
    "topAlgorithms": "Популарни алгоритми",
    "featuredAlgorithms": "Одбрани алгоритми",
    "topCategories": "Популарни категории",
    "sortsCategories": "Подредувања",
    "searchesCategories": "Пребарувања",
    "ciphersCategories": "Шифрирање",
    "indexMetaDescription": "Open Source ресурси за учење Податочни Структури и Алгоритми и нивна имплементација во било кој Програмски Јазик",
    "algorithmMetaDescription": "{algorithm} имплементиран во {implementations}",
    "algorithmMetaDescriptionExplained": "{algorithm} објаснет и имплементиран во {implementations}",
    "languageMetaDescription": "Алгоритми имплементирани во {language}",
    "noResults": "Нема резултати за",
    "emptySearch": "Пребарувај алгоритми",
    "analyticsFooter": "Анализи",
    "analyticsTitle": "Анализи за оваа страна",
    "analyticsText": "Користиме [Plausible Analytics] за да собереме анонимни податоци за употребата на страната, за да видеме колку луѓе ја користат, и кои се најчесто користени функционалности. Веб странава не следи поединечни посетители на било кој начин. Секој податок е агрегиран. Не се собираат лични податоци, и не се користат колачиња. Собраните податоци може да се видат тука:",
    "githubRepository": "GitHub репозиториум",
    "documentationLanguage": "Документација",
    "contributorsMore": "и {numberContributors} останати допринесувачи",
    "contributorsTitle": "{algorithm} допринесувачи",
    "contributorsCommits": "{numberCommits} комити",
    "contributorsOneCommit": "1 комит",
    "internalServerError": "Внатрешна серверска грешка",
    "codeplayground": "Игралиште за кодирање",
    "playgroundRunCode": "Изврши го кодот",
    "playgroundTryCode": "Пробај го кодов",
    "playgroundWelcome": "Добродојдојвте на игралиштето за кодирање на TheAlgorithms 👋",
    "playgroundUnsupported": "Вашиот пребарувач не поддржува Web Assembly\nи не може да го изврши кодов.\n\nСѐ уште може да го уредувате кодот на лево.",
    "playgroundErrIdNotFound": "ID за игралиштето не е пронајдено",
    "playgroundErrInvalidLink": "Врската до игралиштето не е исправна",
    "aboutThisAlgorithm": "За алгоритмов",
    "playgroundLoadingPackage": "Се вчитува {package}",
    "playgroundReady": "Подготвени! Започни да го уредуваш кодот на\nлевата страна на екранот и кликни „Изврши го кодот“",
    "fullscreen": "Прикажи на цел екран",
    "aboutUs": "Ние сме група програмери кои си помагаат еден со друг за да изградат нови нешта, од наједноставни до најсложени алгоритми за шифрирање (encryption). Наша цел е да работиме заедно за да документираме, моделираме и кодираме убави, едноставни и интересни алгоритми. Ние сме open-source општество - секој може да допринесе. Си ја проверуваме нашата работа, комуницираме и соработуваме за да решаваме проблеми. Се стремиме да бидеме гостопримливи, да се однесуваме со почит, но и да се осигураме дека нашиот код ги следи најновите програмерски текови (guidelines).",
    "contribute": "Ве охрабруваме да допринесете кон овие репозиториуми. Ако имате алгоритам што сакате да го додадете, промена што сакате да ја направите, грешка што сакате да ја поправите, ве молиме сторете го тоа. Но претходно, прочитајте ги упатствата за допринесување во CONTRIBUTING.md во соодветниот репозиториум. Однесувајте се со почит, бидете од помош, и користете ги најновите верзии на јазиците. Откако ќе ги прочитате упатствата за допринесување, направете fork на репозиториумот, вметнете ги своите промени и поднесете pull request.Може да помогнете со превод на страната преку [Weblate]. Вашата помош е добредојдена, ако сакате да додадете друг јазик, или да поправите веќе постоечки текст."
}
