{
    "algorithmExplanationTitle": "Thuật toán là gì?",
    "algorithmExplanation": "Thuật toán là một tập hợp các quy tắc tiếp nhận một hoặc nhiều dữ liệu đầu vào, sau đó thực hiện các phép tính nội bộ và thao tác dữ liệu, rồi trả về một hoặc một tập hợp các kết quả đầu ra. Tóm lại, thuật toán giúp cuộc sống trở nên dễ dàng hơn. Từ các thao tác dữ liệu phức tạp và hàm băm, đến số học đơn giản, thuật toán tuân theo một tập hợp các bước để tạo ra một kết quả hữu ích. Một ví dụ về thuật toán là một hàm đơn giản nhận hai giá trị đầu vào, cộng chúng lại với nhau và trả về tổng của chúng.",
    "aboutUsTitle": "Về chúng tôi",
    "aboutUs": "Chúng tôi là một nhóm lập trình viên luôn hỗ trợ lẫn nhau xây dựng những điều mới mẻ, dù là viết chương trình mã hóa phức tạp hay thuật toán đơn giản. Mục tiêu của chúng tôi là cùng nhau ghi chép và mô hình hóa các thuật toán đẹp mắt, hữu ích và thú vị bằng code. Chúng tôi là một cộng đồng mã nguồn mở - bất kỳ ai cũng có thể đóng góp. Chúng tôi kiểm tra công việc của nhau, giao tiếp và hợp tác để giải quyết vấn đề. Chúng tôi luôn cố gắng chào đón, tôn trọng, nhưng vẫn đảm bảo mã nguồn của chúng tôi tuân thủ các nguyên tắc lập trình mới nhất.",
    "programmingLanguagesTitle": "Ngôn ngữ lập trình",
    "programmingLanguages": "Chúng tôi hỗ trợ nhiều ngôn ngữ lập trình. Mỗi ngôn ngữ đều có kho lưu trữ GitHub riêng, nơi lưu trữ toàn bộ mã nguồn cho các thuật toán. Dưới đây là danh sách các ngôn ngữ lập trình hiện tại:",
    "contributeTitle": "Đóng góp",
    "contribute": "Bạn có muốn đóng góp không? Có rất nhiều cách tuyệt vời để đóng góp, chẳng hạn như dịch thuật, sửa lỗi (chính tả), cải thiện code, v.v. Nếu bạn mới bắt đầu, hãy xem các vấn đề có nhãn `good first issue`.",
    "donateTitle": "Donate",
    "topAlgorithms": "Các thuật toán nổi bật",
    "featuredAlgorithms": "Các thuật toán thường gặp",
    "topCategories": "Thể loại nổi bật",
    "sortsCategories": "Sắp xếp",
    "searchesCategories": "Tìm kiếm",
    "dynamicProgrammingCategories": "Quy hoạch động",
    "ciphersCategories": "Cipher",
    "dataStructuresCategories": "Cấu trúc dữ liệu",
    "basicMathCategories": "Toán cơ bản",
    "imageProcessingCategories": "Xử lý ảnh",
    "helloAlgorithms": "Xin chào các thuật toán!",
    "welcomeTitle": "Chào mừng đến với thư viện thuật toán nguồn mở lớn nhất của GitHub",
    "searchText": "Tìm kiếm thuật toán",
    "aboutTextNavbar": "Thông tin",
    "algorithmExplaniationFooter": "Định nghĩa của một thuật toán?",
    "aboutUsFooter": "Về chúng tôi",
    "sourceCodeFooter": "Mã nguồn",
    "donateButton": "Quyên góp",
    "donateText": "Bạn có thể hỗ trợ công việc mã nguồn mở của chúng tôi thông qua [Liberapay]. Bằng cách quyên góp cho chúng tôi, bạn sẽ nhận được một vai trò đặc biệt trên máy chủ Discord và sẽ giúp chúng tôi duy trì dự án này. Cảm ơn sự ủng hộ của bạn, dù bạn có quyên góp hay không.",
    "moreAlgorithmCard": "Nhiều hơn",
    "lightModeNavbar": "Sáng",
    "darkModeNavbar": "Tối",
    "changeLanguageNavbar": "Đổi ngôn ngữ",
    "socialTitle": "Kết nối với chúng tôi",
    "socialGithub": "Đóng góp trên Github",
    "socialGitter": "Chat trên Gitter",
    "socialDiscord": "Chat trên Discord",
    "pageNotFound": "Không tìm thấy trang",
    "home": "Trang chủ",
    "search": "Tìm kiếm",
    "languages_count": "Và {} khác nữa",
    "langImplementation": "{language} Triển khai",
    "contact": "Liên hệ",
    "editPageEdit": "Chỉnh sửa trang",
    "editPageAddImplementation": "Thêm triển khai",
    "editPageAddExplanation": "Thêm giải thích",
    "editPageTranslate": "Dịch giải thích",
    "addExplanation": "Thêm giải thích cho thuật toán này",
    "addExplanationInfo": "Thuật toán này hiện chưa có giải thích. Các giải thích nằm trong kho lưu trữ [Algorithms-Explanations]. Nếu bạn muốn thêm giải thích, hãy fork kho lưu trữ này và thêm giải thích dưới dạng tệp markdown ([example]). Sau khi hoàn tất, bạn có thể mở PR để merge giải thích của mình.",
    "editPageHelp": "Nếu bạn gặp bất kỳ vấn đề nào, hãy thoải mái truy cập máy chủ [Discord] của chúng tôi và yêu cầu trợ giúp.",
    "addImplementation": "Thêm triển khai khác",
    "addImplementationInfo": "Để thêm bản triển khai bằng ngôn ngữ khác, vui lòng truy cập kho lưu trữ cho ngôn ngữ đó và làm theo hướng dẫn trong <code>README.md</code> và <code>CONTRIBUTING.md</code>.",
    "addImplementationMissing": "Sau đây là các liên kết đến các kho lưu trữ vẫn còn thiếu bản triển khai:",
    "addTranslation": "Dịch giải thích này",
    "addTranslationInfo": "Phần giải thích cho thuật toán này chưa được dịch sang ngôn ngữ của bạn. Để dịch phần giải thích này, vui lòng truy cập kho lưu trữ [Algorithms-Explanation]. Fork kho lưu trữ này và thêm bản dịch của bạn dưới dạng tệp Markdown mới dựa trên tiếng Anh [<code>{ogFilename}</code>] trong đúng thư mục cho ngôn ngữ của bạn (<code>{locale}</code>). Sau khi dịch xong tệp, bạn có thể tạo một yêu cầu kéo mới để hợp nhất bản dịch của mình.",
    "viewOnGithub": "Xem trên Github",
    "indexMetaDescription": "Tài nguyên Open Source để học Cấu trúc dữ liệu &amp; Thuật toán và cách triển khai chúng ở bất kỳ ngôn ngữ lập trình nào",
    "algorithmMetaDescription": "{algorithm} được triển khai ở {implementations}",
    "algorithmMetaDescriptionExplained": "{algorithm} được giải thích và triển khai ở {implementations}",
    "languageMetaDescription": "Các thuật toán được triển khai ở {language}",
    "noResults": "Không có kết quả cho",
    "emptySearch": "TÌm kiếm thuật toán",
    "analyticsFooter": "Phân tích",
    "analyticsTitle": "Phân tích trên trang này",
    "analyticsText": "Chúng tôi sử dụng [Plausible Analytics] trên trang web này để thu thập dữ liệu sử dụng ẩn danh nhằm xem có bao nhiêu người đang sử dụng trang web của chúng tôi và những tính năng nào được sử dụng nhiều nhất. Trang web không theo dõi bất kỳ khách truy cập nào. Tất cả dữ liệu chỉ ở dạng tổng hợp. Không thu thập dữ liệu cá nhân và không sử dụng cookie. Bạn có thể xem tất cả dữ liệu đã thu thập tại đây:",
    "githubRepository": "Github repository",
    "documentationLanguage": "Tài liệu",
    "contributorsMore": "và {numberContributors} người đóng góp khác",
    "contributorsTitle": "{algorithm} Người đóng góp",
    "contributorsOneCommit": "1 commit",
    "contributorsCommits": "{numberCommits} lượt commits",
    "internalServerError": "Lỗi máy chủ nội bộ",
    "codeplayground": "Sân chơi",
    "playgroundRunCode": "Chạy code",
    "playgroundTryCode": "Thử code này",
    "playgroundWelcome": "Chào mừng đến với Sân chơi của TheAlgorithms 👋",
    "playgroundUnsupported": "Trình duyệt của bạn không hỗ trợ Webassembly\nvà do đó không thể chạy code.\n\nBạn vẫn có thể chỉnh sửa code ở bên trái.",
    "playgroundErrIdNotFound": "Không tìm thấy ID sân chơi",
    "playgroundErrInvalidLink": "Liên kết không hợp lệ",
    "aboutThisAlgorithm": "Về thuật toán này",
    "playgroundLoadingPackage": "Đang tải {package}",
    "playgroundReady": "Sẵn sàng! Bắt đầu bằng cách chỉnh sửa code ở\nbên trái màn hình và nhấp vào \"Chạy code\"",
    "fullscreen": "Toàn màn hình"
}
