{
    "donateText": "Alia maniero kiel vi povas subteni nin estas fari donacon per [Liberapay]. Eĉ malgranda donaco tre gravas. Donacoj signifas, ke vi dankas kaj ŝatas nian laboron. Se vi ne ŝatas nian laboron, ne necesas donaci. Se vi donacos, plej bonaj anoj povos kontribui plu al projektoj de The Algorithms. Ni dankas pro donacoj de ĉiuj ajn, de ĉie ajn, de ajna kvanto.",
    "contribute": "Ni instigas vin kontribui al ĉi tiuj deponejoj. Se vi havas algoritmon, kiun vi volas aldoni, ŝanĝon, kiun vi volas fari, aŭ cimon, kiun vi volas ripari, bonvolu fari tion. Sed antaŭ ol fari tion, certigu, ke vi legis la kontribuajn gvidnormojn en CONTRIBUTING.md en la deponejo. Certigu, ke vi estas respektema, helpema kaj uzas la plej novan version de la lingvo. Post legi la kontribuajn gvidnormojn, bonvolu forki la deponejon, fari viajn ŝanĝojn kaj poste sendi ilin per tirpeto. Vi ankaŭ povas helpi nin traduki la retejon ĉe [Weblate]. Se vi havas aliajn lingvojn, en kiujn vi volas traduki, aŭ volas korekti kelkajn signoĉenojn, vi estas bonvena.",
    "aboutUs": "Ni estas grupo de programistoj helpantaj unu la alian konstrui novaĵojn, ĉu kompleksaj ĉifraj programoj, ĉu simplaj ĉifroj. Ni celas kunlabori por kode dokumenti kaj modeligi belajn, utilajn kaj interesajn algoritmojn. Ni estas malfermitfonta komunumo — ĉiuj rajtas kontribui. Ni kontrolas la laboron de niaj kolegoj, komunikas kaj kunlaboras por solvi problemojn. Ni strebas esti bonvenigaj kaj respektemaj, tamen certigante, ke nia kodo konformas al la plej novaj programaj gvidnormoj.",
    "algorithmExplanation": "Algoritmo estas aro de reguloj, kiuj akceptas unu aŭ plurajn enigaĵojn, kaj faras internajn kalkulojn kaj datenmanipuladon, kaj liveras unu aŭ plurajn eligaĵojn. Resume, algoritmoj faciligas la vivon. De komplikaj datenmanipuladoj kaj haketaĵoj, ĝis simpla aritmetiko, algoritmoj sekvas aron de paŝoj por liveri utilan rezulton. Unu ekzemplo de algoritmo estas simpla funkcio, kiu prenas du enigitajn valorojn, sumigas ilin, kaj eligas ilian sumon.",
    "programmingLanguages": "Ni subtenas multajn programlingvojn. Ĉiu lingvo havas sian propran GitHub-deponejon, kie konserviĝas la fontkodoj de la algoritmoj. Jen listo de la subtenataj programlingvoj:",
    "welcomeTitle": "Bonvenon al la plej granda biblioteko de malfermitfontaj algoritmoj ĉe GitHub",
    "socialDiscord": "Babili ĉe Discord",
    "socialGitter": "Babili ĉe Gitter",
    "socialGithub": "Kontribui ĉe GitHub",
    "socialTitle": "Konekti al ni",
    "changeLanguageNavbar": "Ŝanĝi lingvon",
    "darkModeNavbar": "Malhela etoso",
    "lightModeNavbar": "Hela etoso",
    "moreAlgorithmCard": "Plu",
    "donateButton": "Donaci",
    "sourceCodeFooter": "Fontkodo",
    "allAlgorithmsFooter": "Ĉiuj algoritmoj",
    "aboutUsFooter": "Pri ni",
    "algorithmExplaniationFooter": "Kio estas algoritmo?",
    "aboutTextNavbar": "Pri",
    "searchText": "Serĉi ajnan algoritmon",
    "helloAlgorithms": "Saluton, algoritmoj!",
    "imageProcessingCategories": "Bildtraktado",
    "basicMathCategories": "Baza Matematiko",
    "dataStructuresCategories": "Datenstrukturoj",
    "ciphersCategories": "Ĉifroj",
    "dynamicProgrammingCategories": "Dinamika Programado",
    "sortsCategories": "Ordigalgoritmoj",
    "searchesCategories": "Serĉalgoritmoj",
    "topCategories": "Plej popularaj kategorioj",
    "featuredAlgorithms": "Elstaraj algoritmoj",
    "topAlgorithms": "Plej popularaj algoritmoj",
    "donateTitle": "Donaci",
    "contributeTitle": "Kontribui",
    "programmingLanguagesTitle": "Programlingvoj",
    "aboutUsTitle": "Pri Ni",
    "algorithmExplanationTitle": "Kio estas Algoritmo?",
    "search": "Serĉi",
    "home": "Hejmo",
    "pageNotFound": "Paĝo ne troviĝis",
    "languages_count": "{} pli",
    "contact": "Kontakti nin",
    "viewOnGithub": "Vidi ĉe GitHub",
    "close": "Fermi",
    "addTranslationInfo": "La klarigo pri ĉi tiu algoritmo ankoraŭ ne estas tradukita en vian lingvon. Por traduki ĉi tiun klarigon, bonvolu viziti la deponejon [Algorithms-Explanation]. Forkigu ĉi tiun deponejon, kaj aldonu vian tradukon kiel novan Markdown-dosieron surbaze de la anglalingva [<code>{ogFilename}</code>] en la dosierujo por via lingvo (<code>{locale}</code>). Post kiam vi tradukos la dosieron, petu tiron por kunfandi vian tradukon.",
    "addImplementationInfo": "Por aldoni realigon per alia programlingvo, bonvolu viziti la deponejon por tiu lingvo, kaj sekvu la instrukciojn en la dosieroj <code>README.md</code> kaj <code>CONTRIBUTING.md</code>.",
    "addExplanationInfo": "Ĉi tiu algoritmo ankoraŭ ne havas klarigon. La klarigoj troviĝas en la deponejo [Algorithms-Explanations]. Se vi volas aldoni klarigon, forkigu ĉi tiun deponejon, kaj aldonu la klarigon kiel Markdown-dosieron ([vidu ekzemplon]). Post kiam vi finos, petu tiron por kunfandi vian klarigon.",
    "addImplementationMissing": "Jen la ligoj al tiuj deponejoj, en kiuj ankoraŭ mankas realigoj:",
    "addImplementation": "Aldoni alian realigon",
    "editPageAddImplementation": "Aldoni realigon",
    "langImplementation": "Realigo per {language}",
    "editPageHelp": "Se vi havas problemojn, bonvolu peti helpon per nia [Discord]-servilo.",
    "addExplanation": "Aldoni klarigon pri ĉi tiu algoritmo",
    "addTranslation": "Traduki ĉi tiun klarigon",
    "editPageTranslate": "Traduki klarigon",
    "editPageAddExplanation": "Aldoni klarigon",
    "editPageEdit": "Redakti paĝon",
    "emptySearch": "Serĉi algoritmon",
    "noResults": "Neniuj rezultoj pri",
    "indexMetaDescription": "Malfermitfonta rimedo por lerni datenstrukturojn kaj algoritmojn kaj ilian realigadon per iuj ajn programlingvoj",
    "languageMetaDescription": "Algoritmoj realigitaj per {implementations}",
    "algorithmMetaDescriptionExplained": "{algorithm} klarigita kaj realigita per {implementations}",
    "algorithmMetaDescription": "{algorithm} realigita per {implementations}",
    "analyticsText": "Ni uzas [Plausible Analytics] ĉe ĉi tiu retejo por kolekti anonimajn datenojn pri uzado por scii kiom da homoj uzas nian retejon, kaj kiuj funkcioj estas la plej uzataj. La retejo neniel spuras unuopajn vizitantojn. Ĉiuj datenoj estas prigrupaj. Neniuj personaj datenoj estas kolektataj, kaj neniuj kuketoj estas uzataj. Vi povas vidi ĉiujn kolektitajn datenojn ĉi tie:",
    "analyticsTitle": "Analiziloj ĉe ĉi tiu retejo",
    "analyticsFooter": "Analiziloj",
    "documentationLanguage": "Dokumentaro",
    "githubRepository": "Deponejo ĉe GitHub"
}
