{
    "donateText": "Alia maniero kiel vi povas subteni nin estas fari donacon per <a href=\"https://liberapay.com/\">Liberapay</a>. Eĉ malgranda donaco tre gravas. Donacoj signifas, ke vi dankas kaj ŝatas nian laboron. Se vi ne ŝatas nian laboron, ne necesas donaci. Se vi donacos, plej bonaj anoj povos kontribui plu al projektoj de The Algorithms. Ni dankas pro donacoj de ĉiuj ajn, de ĉie ajn, de ajna kvanto.",
    "contribute": "Ni instigas vin kontribui al ĉi tiuj deponejoj. Se vi havas algoritmon, kiun vi volas aldoni, ŝanĝon, kiun vi volas fari, aŭ cimon, kiun vi volas ripari, bonvolu fari tion. Sed antaŭ ol fari tion, certigu, ke vi legis la kontribuajn gvidnormojn en CONTRIBUTING.md en la deponejo. Certigu, ke vi estas respektema, helpema kaj uzas la plej novan version de la lingvo. Post legi la kontribuajn gvidnormojn, bonvolu forki la deponejon, fari viajn ŝanĝojn kaj poste sendi ilin per tirpeto. Vi ankaŭ povas helpi nin traduki la retejon ĉe <a href=\"https://hosted.weblate.org/engage/TheAlgorithms/?utm_source=widget\">Weblate</a>. Se vi havas aliajn lingvojn, en kiujn vi volas traduki, aŭ volas korekti kelkajn signoĉenojn, vi estas bonvena.",
    "aboutUs": "Ni estas grupo de programistoj helpantaj unu la alian konstrui novaĵojn, ĉu kompleksaj ĉifraj programoj, ĉu simplaj ĉifroj. Ni celas kunlabori por kode dokumenti kaj modeligi belajn, utilajn kaj interesajn algoritmojn. Ni estas malfermitfonta komunumo — ĉiuj rajtas kontribui. Ni kontrolas la laboron de niaj kolegoj, komunikas kaj kunlaboras por solvi problemojn. Ni strebas esti bonvenigaj kaj respektemaj, tamen certigante, ke nia kodo konformas al la plej novaj programaj gvidnormoj.",
    "algorithmExplanation": "Algoritmo estas aro de reguloj, kiuj akceptas unu aŭ plurajn enigaĵojn, kaj faras internajn kalkulojn kaj datenmanipuladon, kaj liveras unu aŭ plurajn eligaĵojn. Resume, algoritmoj faciligas la vivon. De komplikaj datenmanipuladoj kaj haketaĵoj, ĝis simpla aritmetiko, algoritmoj sekvas aron de paŝoj por liveri utilan rezulton. Unu ekzemplo de algoritmo estas simpla funkcio, kiu prenas du enigitajn valorojn, sumigas ilin, kaj eligas ilian sumon.",
    "programmingLanguages": "Ni subtenas multajn programlingvojn. Ĉiu lingvo havas sian propran GitHub-deponejon, kie konserviĝas la fontkodoj de la algoritmoj. Jen listo de la subtenataj programlingvoj:",
    "welcomeTitle": "Bonvenon al la plej granda biblioteko de malfermitfontaj algoritmoj ĉe GitHub",
    "socialDiscord": "Babili ĉe Discord",
    "socialGitter": "Babili ĉe Gitter",
    "socialGithub": "Kontribui ĉe GitHub",
    "socialTitle": "Konekti al ni",
    "changeLanguageNavbar": "Ŝanĝi lingvon",
    "darkModeNavbar": "Malhela etoso",
    "lightModeNavbar": "Hela etoso",
    "moreAlgorithmCard": "Plu",
    "donateButton": "Donaci",
    "sourceCodeFooter": "Fontkodo",
    "allAlgorithmsFooter": "Ĉiuj algoritmoj",
    "aboutUsFooter": "Pri ni",
    "algorithmExplaniationFooter": "Kio estas algoritmo?",
    "aboutTextNavbar": "Pri",
    "searchText": "Serĉi ajnan algoritmon",
    "helloAlgorithms": "Saluton, algoritmoj!",
    "imageProcessingCategories": "Bildtraktado",
    "basicMathCategories": "Baza Matematiko",
    "dataStructuresCategories": "Datenstrukturoj",
    "ciphersCategories": "Ĉifroj",
    "dynamicProgrammingCategories": "Dinamika Programado",
    "sortsCategories": "Ordigalgoritmoj",
    "searchesCategories": "Serĉalgoritmoj",
    "topCategories": "Plej popularaj kategorioj",
    "featuredAlgorithms": "Elstaraj algoritmoj",
    "topAlgorithms": "Plej popularaj algoritmoj",
    "donateTitle": "Donaci",
    "contributeTitle": "Kontribui",
    "programmingLanguagesTitle": "Programlingvoj",
    "aboutUsTitle": "Pri Ni",
    "algorithmExplanationTitle": "Kio estas Algoritmo?",
    "search": "Serĉi",
    "home": "Hejmo",
    "pageNotFound": "Paĝo ne troviĝis",
    "languages_count": "{} pli",
    "contact": "Kontakti nin"
}
